{"text": "My wife was driving southeast on a fairly populated main side road, it was dark out side at about 6:43pm, And my wife exclaimed” falling star baby look quick!” When I looked up I saw not a falling star but a bright ball of light , one that was closer than any shooting star I have ever seen, it had a blue glow  changing into green colors of light as it fell from the sky. It fell as if falling from an invisible opening in the sky... the night was a crystal clear night sky  so no clouds or precipitation to obstruct our view and the object was closer than any I have ever witnessed before. The way the object fell was too slow to be a meteor or falling star, also noting that there was no “light trail” following behind the object as it fell. We watched it fall for about 5 seconds before it disappeared into the dark night sky somewhere close to the earth surface.  It was the strangest light; object; ufo... I have encountered and felt a duty to report it.", "stats": "Occurred : 12/12/2019 18:43  (Entered as : 12/12/19 18:43) Reported: 12/19/2019 7:19:31 PM 19:19 Posted: 12/22/2019 Location: Chester, VA Shape: Light Duration:5 seconds", "date_time": "12/12/19 18:43", "report_link": "http://www.nuforc.org/webreports/151/S151739.html", "city": "Chester", "state": "VA", "shape": "Light", "duration": "5 seconds", "summary": "My wife was driving southeast on a fairly populated main side road, it was dark out side at about 6:43pm, And my wife exclaimed” fallin", "posted": "12/22/19"}
{"text": "I think that I may caught a UFO on the NBC Nightly News that aired March 21st or 22nd. In this short clip of a Boeing 747, as the plane flies left to right, you can see a black circular object flying eradicably (sic.  Erraticly)) behind the tail wing,  I’m guessing at a distance of about 25-30 feet. If you slow the video down you can home in on the object more so.", "stats": "Occurred : 3/22/2019 18:30  (Entered as : 03/22/19 18:30) Reported: 3/27/2019 4:10:19 PM 16:10 Posted: 3/29/2019 Location: Rocky Hill, CT Shape: Circle Duration:3-5 seconds", "date_time": "3/22/19 18:30", "report_link": "http://www.nuforc.org/webreports/145/S145297.html", "city": "Rocky Hill", "state": "CT", "shape": "Circle", "duration": "3-5 seconds", "summary": "I think that I may caught a UFO on the NBC Nightly News that aired March 21st or 22nd.", "posted": "3/29/19"}
{"text": "I woke up late in the afternoon 3:30-4pm.  I went to have a bath, while shaving my legs i noticed indentations around my left ankel.  I then noticed that they went all the way around the backs of both my legs and up to my thighs.  It scared me because a few nights before I was telling my fiancee that was pretty sure that i was abducted before, he laughed then that was that.  I showed him the indentations and he was shocked.  He suffers from insomnia.  We woke up at the same time.  He only sleeps maybe 4-5 hrs a wk.  He said that he slept all night with me.  The indentations look like my legs were seperated into stirups, or like how a massage chair would hold your legs.  The indents were in rows of 1-1.5 lines from my ankles all the way up to my thighs just below my buttocks.  They were perfectly lined.  They disappeared within 2 hrs of waking up.  I couldnt talk a picture because i had just lost my cell phone.", "stats": "Occurred : 4/1/2019 15:45  (Entered as : April01.19) Reported: 4/8/2019 9:42:31 PM 21:42 Posted: 4/12/2019 Location: Winnipeg (Canada),  Shape:  Duration:", "date_time": "April01.19", "report_link": "http://www.nuforc.org/webreports/145/S145556.html", "city": null, "state": null, "shape": null, "duration": null, "summary": "I woke up late in the afternoon 3:30-4pm. I went to have a bath, while shaving my legs i noticed indentations around my left ankel. I t", "posted": "4/12/19"}
{"text": "I was driving towards the intersection of fallowfield and eagleson when I saw a where streak in the sky like a falling plane or something.  I was shocked and it went down really fast towards the ground and disappeared.  Sorry for lack of details.  That is all I know.", "stats": "Occurred : 4/17/2019 02:00  (Entered as : 04-17-2019 2:00) Reported: 4/17/2019 8:41:25 AM 08:41 Posted: 4/18/2019 Location: Ottawa (Carleton) (Canada), ON Shape: Teardrop Duration:10 seconds", "date_time": "4/17/19 02:00", "report_link": "http://www.nuforc.org/webreports/145/S145697.html", "city": "Ottawa (Carleton) (Canada)", "state": "ON", "shape": "Teardrop", "duration": "10 seconds", "summary": "I was driving towards the intersection of fallowfield and eagleson when I saw a where streak in the sky like a falling plane or somethi", "posted": "4/18/19"}
{"text": "In Peoria, Arizona, I saw a cigar shaped craft floating above the neighborhood 500 feet up silent, emitted brilliant colors, Peoria Arizona - 2009 - On my way home from work - normal evening - as I turned onto my home street i saw a huge huge craft floating above the neighborhood in front of me.  It was cigar shaped, but had a huge bulge in the middle (I used to call it a pregnant joint - if you are familiar with how that would look - skinny on the ends but bulging in the middle.  It made no noise at all and had circular shapes on the front which emitted different colored lights - like it pulsated the lights - orange to red to green to blue.  They were the most brilliant colors I’ve ever seen it’s hard to describe how perfect the colors were.  It was huge like an aircraft carrier in the sky.  It was floating and did not move at all.  I parked in my driveway and ran inside to tell my Roomate.  By the time I was outside, it was gone but there as a trail of haze.  I will never forget it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)", "stats": "Occurred : 3/15/2009 18:00  (Entered as : 03/15/09 18:00) Reported: 4/17/2019 6:30:52 PM 18:30 Posted: 4/18/2019 Location: Peoria, NY Shape: Cigar Duration:2 minutes", "date_time": "3/15/09 18:00", "report_link": "http://www.nuforc.org/webreports/145/S145723.html", "city": "Peoria", "state": "NY", "shape": "Cigar", "duration": "2 minutes", "summary": "In Peoria Arizona, I saw a cigar shaped craft floating above the neighborhood 500 feet up silent, emitted brilliant colors,", "posted": "4/18/19"}
{"text": "The object has flashing lights that are green, blue, red, and white.  The lights revolves around the object.  The object hovers in the same area for a long period of time. ((ADDENDUM FROM WITNESS)) Thank you for responding.  The object seemed sphere or disc shaped.  The object was extremely far away, but we were able to see every color.  At one point a plane flew under the object and we were able to see how large it was in comparison.  It was at least two or three times the size of the aircraft.  The object ended up hovering for over an hour that we saw.  At one point the object dipped down and we noticed a smaller object below it that was similar.  When the larger object reached the smaller one, all of the sudden the smaller object disappeared.  We then noticed a large plane that flew under the large object flying North. The large object then suddenly disappeared. Please understand that I have never believed in UFO's nor do I believe in conspiracy theories.  This is a true account of what we have seen. I was not alone in seeing this object.  I do have a recording but my camera is so bad that it is difficult to see any of the colors that we saw on the recording.  Also, the object seemed much smaller in the recording than in real life.  If you would like for me to send you an attachment I will be more than happy to provide the documentation.  If there is an explanation for what was seen, please let me know. Thank you! ((END ADDENDUM)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))", "stats": "Occurred : 4/2/2019 20:25  (Entered as : 04/02/2019 20:25) Reported: 4/3/2019 6:36:52 PM 18:36 Posted: 4/8/2019 Location: Kirbyville, TX Shape: Disk Duration:15 minutes", "date_time": "4/2/19 20:25", "report_link": "http://www.nuforc.org/webreports/145/S145476.html", "city": "Kirbyville", "state": "TX", "shape": "Disk", "duration": "15 minutes", "summary": "The object has flashing lights that are green, blue, red, and white.  The lights revolves around the object.  The object hovers.", "posted": "4/8/19"}
{"text": "Description is the same as Washington, DC, event in the 50’s   Glitter type objects . Still scanning .... A-10’s scrambled out of David monathin airbase. ??", "stats": "Occurred : 5/1/2019 11:00  (Entered as : 5/1/19 11:00) Reported: 5/1/2019 11:26:56 AM 11:26 Posted: 5/9/2019 Location: Tucson, AZ Shape: Unknown Duration:5 minutes", "date_time": "5/1/19 11:00", "report_link": "http://www.nuforc.org/webreports/145/S145947.html", "city": "Tucson", "state": "AZ", "shape": "Unknown", "duration": "5 minutes", "summary": "Description is the same as Washington DC event in the 50’s  Glitter type objects .", "posted": "5/9/19"}
{"text": "Apr. 10th we witnessed a very bright silvery round object hovering near zenith over our community looking like a very bright star. On Apr. 10th at aprox. 7pm we witnessed a very bright silvery round object hovering near zenith over our community looking like a very large bright star.  It did not appear to move for the 10 minutes it was observed in conflict with very strong winds.  It changed color from bright shinny to reddish as the sun was setting, made no noise, and was unobservable after the sunset.  2 photos were taken with each  looking totally different in appearance ... they were taken only 3 min. apart. The observers are all retired professionals.", "stats": "Occurred : 4/10/2019 17:00  (Entered as : 04/10/2019 17:00) Reported: 4/20/2019 5:28:10 PM 17:28 Posted: 4/25/2019 Location: Gold Canyon, AZ Shape: Circle Duration:10 minutes", "date_time": "4/10/19 17:00", "report_link": "http://www.nuforc.org/webreports/145/S145766.html", "city": "Gold Canyon", "state": "AZ", "shape": "Circle", "duration": "10 minutes", "summary": "Apr. 10th we witnessed a very bright silvery round object hovering near zenith over our community looking like a very bright star.", "posted": "4/25/19"}
{"text": "Ufos report in Irving Texas at 2200 hrs.  On or about July 1973 or 1974. Myself and my mother her sister and daughter was watching tv waiting for the news to come on, at 2200 hrs watching wffa channel 8 news the reporter said, \"Folks, if you want to see something amazing go out side and look over the Dallas skyline\" which we did as well as most of the block. What we all saw was three objects looked like the size of a golf balls from about 9 miles from Dallas texas looking east.  At about a 1000 to 1500 feet above Dallas.  These objects was stationery each emitting different colors like blue gold red green silver.  It was rather superb looking.  After just standing there for about a minute each one started to do bizzar monuvers like one was zigzaging the other one was going up then down zipping from on side of the sky back and forth with the other two, at on point they formed a close circle and went spinning around at very fast speed. This lasted for about 3 min.  When the US Navy put a halt to the airshow as they scrambled two F-8 crusaders which at that time was hot alert aircraft, which ment they was armed with the sidewinder missile, along with the 50.cal guns.  They flew from NAS Hensley field out side of Dallas on the southwest just about 6 miles away, it only took about 20 seconds from the time they took off to get  over Dallas.  (I seen them as they left the air station only 3 miles away) never will forget how loud they was in full afterburner,  Just before they got on station, the three objects shot straight up in the night sky in a split second.  The F-8s made a few passes over Dallas before returning to there base. This left me with a impression that the ufos wanted to show the people what they could do, I know aircraft and it was nothing  that any aircraft or helicopter could do. Not only did my family see this but was reported by was channel 8 news along with hundreds of people I will say on thing this report is not a hoax I seen other sightings as well but none as this one.", "stats": "Occurred : 7/14/1973 22:00  (Entered as : 07/14/73 22:00) Reported: 4/20/2019 2:21:04 AM 02:21 Posted: 4/25/2019 Location: Dallas, TX Shape: Oval Duration:6 minutes", "date_time": "7/14/73 22:00", "report_link": "http://www.nuforc.org/webreports/145/S145751.html", "city": "Dallas", "state": "TX", "shape": "Oval", "duration": "6 minutes", "summary": "Ufos report in Irving Texas at 2200 hrs. On or about July 1973 or 1974.", "posted": "4/25/19"}
{"text": "group of lights formation sweeping thru a night sky sigthing of strange group light almost transparent coming from going northward.  I found an video from youtube almost like what I saw of this group of light.I took a snip of this image from the video from mufon.  What i saw is exactly like that.  should you need the image capture from youtube image from mufon will gladly email it.  Just to prove what i saw, and maybe you can tell me if what I saw is authentic.  Philippines is the least place to experience this kind of unidentified object.  Again next time i will have a cellphone camera ready or any image capturing device.", "stats": "Occurred : 6/6/2019 19:00  (Entered as : 6/6/2019 19:00) Reported: 6/7/2019 12:10:27 PM 12:10 Posted: 6/7/2019 Location: Caloocan City (Philippines),  Shape: Other Duration:19:00 to 19:30", "date_time": "6/6/19 19:00", "report_link": "http://www.nuforc.org/webreports/146/S146694.html", "city": "Caloocan City (Philippines)", "state": null, "shape": "Other", "duration": "19:00 to 19:30", "summary": "Group of lights formation sweeping thru a night sky", "posted": "6/7/19"}
{"text": "Metal orb of wires that was seen through a telescope after noticing a bright light that hovered in the sky for about an hour. Noticed a light in the sky that looked like an airplane, but never moved.  Proceeded to get telescope out and noticed a sphere that looked as if it was made out of wires.  Also noticed 2 black things inside of the center or at times one black thing and a tail on it.  No lights were on it and once the sun went over the horizon it was very hard to see.  There was 3 other of these lights in the sky very far apart from each other.   The whole incident lasted a whole hour but I am sure it was there for half an hour more at least. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))", "stats": "Occurred : 6/18/2019 21:00  (Entered as : 6/18/19 21:00) Reported: 6/18/2019 7:10:28 PM 19:10 Posted: 6/20/2019 Location: Brookville, IN Shape: Sphere Duration:1 hour", "date_time": "6/18/19 21:00", "report_link": "http://www.nuforc.org/webreports/146/S146900.html", "city": "Brookville", "state": "IN", "shape": "Sphere", "duration": "1 hour", "summary": "Metal orb of wires that was seen through a telescope after noticing a bright light that hovered in the sky. ((anonymous report))", "posted": "6/20/19"}
{"text": "We think 2 UFOs....2 tiny lights recorded for about a minute.  We watched the top light bolt higher and then the lower light does an unbelievable semi circle motion.  Moved SO FAST like nothing I have ever seen before.", "stats": "Occurred : 6/12/2019 22:00  (Entered as : 06/12/2019 22:00) Reported: 6/13/2019 5:27:17 AM 05:27 Posted: 6/20/2019 Location: Melbourne Beach, FL Shape: Unknown Duration:Hour", "date_time": "6/12/19 22:00", "report_link": "http://www.nuforc.org/webreports/146/S146805.html", "city": "Melbourne Beach", "state": "FL", "shape": "Unknown", "duration": "Hour", "summary": "2 tiny lights recorded for about a minute.  We watched the top light bolt higher and then the lower light does a semi-circle.", "posted": "6/20/19"}
{"text": "I was driving and saw three glowing orbs is the best I can describe it.  I was driving trying to keep an eye on it and as I watched it, it just disappeared.  I also saw something else that could be related, it just didn't look right two lights almost looked like they were hovering and they did change location in the sky and were lower than the stars or what could be satellites, it did not look right to me", "stats": "Occurred : 6/11/2019 22:00  (Entered as : June 11 20 22:00) Reported: 6/11/2019 10:18:14 PM 22:18 Posted: 6/20/2019 Location: Carrizozo, NM Shape: Changing Duration:Few minutes", "date_time": "6/11/19 22:00", "report_link": "http://www.nuforc.org/webreports/146/S146759.html", "city": "Carrizozo", "state": "NM", "shape": "Changing", "duration": "Few minutes", "summary": "I was driving and saw three glowing orbs is the best I can describe it. I was driving trying to keep an eye on it and as I watched it,", "posted": "6/20/19"}
{"text": "I was in pool and my wife was sitting on the edge. We heard a sound to the southwest.  It sound like a jet type engine, but not a plane.  Then a circular object came over the trees of our back yard at what I would say would be a helicopter type height, but it was not a helicopter. It didn't sound like a jet or a helicopter, but it was a jet type sound. It moved slowly in a northeast direction and hovered directly over our pool for about 5 to 10 seconds and then continued to slowly continue. When it was above we could see what looked like two jet type engines at the back of the craft facing in a downward direction then they rotated back some and it continued moving slowly until it was out of site due to the roof of our house. We were both looking in amazement and didn't think to grab my phone to video until it had almost cleared the house and you really could see anything on the video since I tried to take the video so fast. We live near Space X, which is the general direction it came from and are about 35 minutes from Ft. Hood army base.  So we thought maybe it might be an experimental craft. I am so mad at myself for not immediately grabbing my phone. ((NUFORC Note:  We spoke via telephone with the witness, and he corrected the date to 2018.  He seemed to us to be quite sober-minded, and we suspect that he and his wife probably are very capable and reliable witnesses.  PD))", "stats": "Occurred : 6/15/2018 01:00  (Entered as : 06/15/19 1:00) Reported: 6/10/2019 1:23:41 PM 13:23 Posted: 6/20/2019 Location: Waco, TX Shape: Circle Duration:2 minute", "date_time": "6/15/18 01:00", "report_link": "http://www.nuforc.org/webreports/146/S146740.html", "city": "Waco", "state": "TX", "shape": "Circle", "duration": "2 minute", "summary": "I was in pool and my wife was sitting on the edge.", "posted": "6/20/19"}
{"text": "Bright Circle of Light followed me from Oskaloosa, IA, to Centerville, IA.. I was on my way home from Pella, IA.  Driving to Centerville, IA.  Around the Oskaloosa, IA exit. I seen a bright white light.  It stayed with me until I reached Centerville, IA.  There is a water tower on the south east  side of town.  I stopped and the light stopped and it was between the ball on top of the water tower and the part that comes out of the ground.   I rolled down my window.  It made no noise the light didn’t move this was for about 4 minutes. .  I got scared and started to drive and the light went straight up into the sky and went back north. Back in the direction in which it followed me.   I wish I would have gotten out of my car and walked towards it.  I hope before I pass I am able to see it again or see another UFO.  I won’t be scared and I will try and get closer.  It is now 2019.", "stats": "Occurred : 8/15/1999 02:30  (Entered as : 08/15/1999 2:30) Reported: 6/8/2019 1:55:19 AM 01:55 Posted: 6/20/2019 Location: Centerville, IA Shape: Circle Duration:1 hour", "date_time": "8/15/99 02:30", "report_link": "http://www.nuforc.org/webreports/146/S146702.html", "city": "Centerville", "state": "IA", "shape": "Circle", "duration": "1 hour", "summary": "Bright Circle of Light followed me from Oskaloosa IA to Centerville, IA.", "posted": "6/20/19"}
{"text": "Strange bright light hovered over mobile home. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)", "stats": "Occurred : 7/17/1975 00:00  (Entered as : 07/17/1975 00:00) Reported: 6/27/2019 7:49:44 PM 19:49 Posted: 7/5/2019 Location: Gray Court, SC Shape: Light Duration:5 minutes", "date_time": "7/17/75 00:00", "report_link": "http://www.nuforc.org/webreports/147/S147117.html", "city": "Gray Court", "state": "SC", "shape": "Light", "duration": "5 minutes", "summary": "Strange bright light hovered over mobile home.", "posted": "7/5/19"}
{"text": "There were 4 lights in diagonal formation that moved side to side to side.  The fifth craft was moving in a figure 8 motion.  The fifth craft was noticeably lower than the others.   I have video proof of the 4 diagonal crafts.", "stats": "Occurred : 8/17/2019 00:00  (Entered as : 081719 0:00) Reported: 8/17/2019 2:10:35 AM 02:10 Posted: 8/23/2019 Location: Yuba City, CA Shape: Formation Duration:20 minutes", "date_time": "8/17/19 00:00", "report_link": "http://www.nuforc.org/webreports/148/S148345.html", "city": "Yuba City", "state": "CA", "shape": "Formation", "duration": "20 minutes", "summary": "There were 4 lights in diagonal formation that moved side to side to side.  The fifth craft was moving in a figure 8 motion.", "posted": "8/23/19"}
{"text": "star-like light that started bouncing in the air before disappearing I was driving on the highway heading south, and in the air kind of behind these apartments off of the highway there was a bright light that looked like a star but was a slight bit bigger and brighter, it had a light blue color to it.  it was floating there for a few seconds then it started “bouncing” up and down rapidly in the air and changing colors from light blue to red. it stopped bouncing and sat still for a few seconds before it disappeared.", "stats": "Occurred : 8/14/2019 01:00  (Entered as : 08/14/19 01:00) Reported: 8/19/2019 1:26:51 AM 01:26 Posted: 8/23/2019 Location: Abilene, TX Shape: Light Duration:30 seconds", "date_time": "8/14/19 01:00", "report_link": "http://www.nuforc.org/webreports/148/S148373.html", "city": "Abilene", "state": "TX", "shape": "Light", "duration": "30 seconds", "summary": "Star-like light that started bouncing in the air before disappearing", "posted": "8/23/19"}
{"text": "There where 4 bright lights in a shape of a diamond, they where moving slow.  After I took the video one of the lights went east and the other three lights remained in the same spot.", "stats": "Occurred : 8/9/2019 20:22  (Entered as : 08/09/19 20:22) Reported: 8/10/2019 3:06:11 PM 15:06 Posted: 8/23/2019 Location: Leyner, CO Shape: Light Duration:20 minutes", "date_time": "8/9/19 20:22", "report_link": "http://www.nuforc.org/webreports/148/S148205.html", "city": "Leyner", "state": "CO", "shape": "Light", "duration": "20 minutes", "summary": "There where 4 bright lights in a shape of a diamond, they where moving slow. After I took the video one of the lights went east and the", "posted": "8/23/19"}
{"text": "My wife and I were taking our usual evening stroll approx. 8:30 to 8:40 pm in the evening.  We observed a cigar shaped craft hovering in the south west sky approx. 1000 feet.  Color was orangish red.  It caught out attention bc at first it lit up rather brightly for several seconds then dimmed down and shifted to the west then slowly faded out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))", "stats": "Occurred : 8/9/2019 20:30  (Entered as : 08/09/19 20:30) Reported: 8/15/2019 11:16:08 AM 11:16 Posted: 8/23/2019 Location: Catalina, AZ Shape: Cigar Duration:40 seconds", "date_time": "8/9/19 20:30", "report_link": "http://www.nuforc.org/webreports/148/S148290.html", "city": "Catalina", "state": "AZ", "shape": "Cigar", "duration": "40 seconds", "summary": "My wife and I were taking our usual evening stroll approx. 8:30 to 8:40 pm in the evening. We observed a cigar shaped craft hovering in", "posted": "8/23/19"}
{"text": "Abnormal flashing object in SoCal As an avid skywatcher since birth (51 hrs), I take pride in my recognition skills concerning flying objects.  While relaxing on my back porch after a long day of work, I noticed what appeared to be a flashing satellite.  The trajectory was circumpolar and velocity was consistant with average satellites.  The object was first noticed at the zenith.  The first flash was of approximately -6 magnitude brightness and lasted 3 seconds.  So far this seemed normal for a rotating solar paneled satellite.  Every 22 seconds the object flashed at a consistent magnitude until it disappeared over the northern horizon.  The odd thing is the flashing was consistent brightness as though the light was radiating all directions. Normal rotating satellites will flash at most twice before the change in orbital position relative to the observer makes the solar panels flash to a single spot on the earths surface.  The next flash would be hundreds of miles away from the observer one would th! ink.  This is the first time I’ve seen this phenomenon and have seen thousands of satellites in my skywatching. This is my 23rd unexplainable sighting of aerial phenomena. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))", "stats": "Occurred : 8/6/2019 20:45  (Entered as : 08/06/19 20:45) Reported: 8/7/2019 8:56:43 PM 20:56 Posted: 8/23/2019 Location: Santa Barbara, CA Shape: Flash Duration:5 minutes", "date_time": "8/6/19 20:45", "report_link": "http://www.nuforc.org/webreports/148/S148122.html", "city": "Santa Barbara", "state": "CA", "shape": "Flash", "duration": "5 minutes", "summary": "Abnormal flashing object in SoCal", "posted": "8/23/19"}
{"text": "Very unusual, extreme chevron-shaped aircraft observed mid-afternoon, clear sky, flying west overhead East Beach, Charlestown, RI This was a most unusual aircraft design,singurlarly moving directly overhead at plane travel height, in a westerly direction over East Beach shorefront.  This very futuristically shaped 'aircraft', or very large drone, dark colored, with broad sweptback wings and tail, seemed to have a typical airplane engine noise, appeared to travel at a typical airplane speed, and moved along a straight path as other typically observed aircraft that we've seen overhead that area. The most remarkable thing that we both agreed was the shape.", "stats": "Occurred : 8/5/2019 14:00  (Entered as : 08/05/19 14:00) Reported: 8/8/2019 6:45:55 AM 06:45 Posted: 8/23/2019 Location: Charlestown, RI Shape: Chevron Duration:30 seconds", "date_time": "8/5/19 14:00", "report_link": "http://www.nuforc.org/webreports/148/S148130.html", "city": "Charlestown", "state": "RI", "shape": "Chevron", "duration": "30 seconds", "summary": "Very unusual, extreme chevron-shaped aircraft observed mid-afternoon, clear sky, flying west overhead East Beach, Charlestown, RI", "posted": "8/23/19"}
{"text": "A white saucer shaped entity was captured on security camera at high speed going into clouds.", "stats": "Occurred : 8/3/2019 18:53  (Entered as : 08/03/19 18:53) Reported: 8/5/2019 6:27:11 AM 06:27 Posted: 8/23/2019 Location: Springfield, TN Shape: Disk Duration:3 seconds", "date_time": "8/3/19 18:53", "report_link": "http://www.nuforc.org/webreports/148/S148057.html", "city": "Springfield", "state": "TN", "shape": "Disk", "duration": "3 seconds", "summary": "A white saucer shaped entity was captured on security camera at high speed going into clouds.", "posted": "8/23/19"}
{"text": "7 stationary brightly lit objects seen  over hillside homes 7 brightly lit yellowish gold and aqua bluish green lights were seen hovering between 2 hillside homes near the foothills of Mt. Tamalpais.  The lights made no sound and were all within a 100 yard space in between these two homes.  I was standing about 3 blocks away from this activity.  The lights went out one by one.  3 of the lights were slanted in a 7 to 2 o:clock position with one of the 3 lights in the middle.  Other lights appearing in pairs slanted in a 11 o:clock to 5 o'clock position were also seen after this sighting but in a different location out near the Ring Mountain Open Preserve hiking trails near the Bay.", "stats": "Occurred : 8/1/2019 22:30  (Entered as : 8-01-19 22:30) Reported: 8/22/2019 2:31:26 PM 14:31 Posted: 8/23/2019 Location: Marin County, CA Shape: Sphere Duration:3 minutes", "date_time": "8/1/19 22:30", "report_link": "http://www.nuforc.org/webreports/148/S148424.html", "city": "Marin County", "state": "CA", "shape": "Sphere", "duration": "3 minutes", "summary": "7 stationary brightly lit objects seen  over hillside homes", "posted": "8/23/19"}
{"text": "Giant x shape with blue and orange lights at each corner It was around 8:12 when i went outside to skate then when i was sitting down to take a break i saw this big X with blue and orange lights on the end of each corner it only lasted like 3  minutes all it did was hover it produced zero sound it didn’t occur to me to take a photo or video because i did not think much of it but when i tried to take a video the lights dimmed and kinda began to blur like the lights looked as if they were blurry then it just went black and i didn't see the thing again it was the first time id ever seen something like this and i honestly think it was extraterrestrial if anyone has seen this please share", "stats": "Occurred : 7/29/2019 08:13  (Entered as : 7/29/19 8:13) Reported: 7/29/2019 5:55:11 PM 17:55 Posted: 8/23/2019 Location: Maitland, FL Shape: Other Duration:3 minutes", "date_time": "7/29/19 08:13", "report_link": "http://www.nuforc.org/webreports/147/S147896.html", "city": "Maitland", "state": "FL", "shape": "Other", "duration": "3 minutes", "summary": "Giant x shape with blue and orange lights at each corner", "posted": "8/23/19"}
{"text": "MADAR Node 138", "stats": "Occurred : 7/25/2019 19:06  (Entered as : 07/25/19 19:06) Reported: 8/1/2019 7:52:28 AM 07:52 Posted: 8/23/2019 Location: Clarksville, TN Shape:  Duration:", "date_time": "7/25/19 19:06", "report_link": "http://www.nuforc.org/webreports/147/S147963.html", "city": "Clarksville", "state": "TN", "shape": null, "duration": null, "summary": "MADAR Node 138", "posted": "8/23/19"}
{"text": "Spotted it behind my property next to Rt 476 North just out side of the turnpike tunnel, at 12:30 AM, then at 1:28AM it hovered over my mobile home no more then 25 ft., above,  It's a large drone, doing work for the turnpike.", "stats": "Occurred : 6/27/2019 01:00  (Entered as : 06/ 27 /19 1:00) Reported: 8/19/2019 8:37:27 AM 08:37 Posted: 8/23/2019 Location: West Bowmanstown, PA Shape: Triangle Duration:First 3min seconed 3 min.", "date_time": "6/27/19 01:00", "report_link": "http://www.nuforc.org/webreports/148/S148370.html", "city": "West Bowmanstown", "state": "PA", "shape": "Triangle", "duration": "First 3min seconed 3 min.", "summary": "Spotted it behind my property next to Rt 476 North just out side of the turnpike tunnel,at 12:30 AM,then at 1:28AM it hovered over my m", "posted": "8/23/19"}
{"text": "4 bright lights weaving in between one another at night. 4 different bright lights flying across the sky weaving in between each other right above the stadium lights of a football field at night.  Happened very fast", "stats": "Occurred : 6/15/2015 22:00  (Entered as : June 2015 22:00) Reported: 7/27/2019 11:36:44 PM 23:36 Posted: 8/23/2019 Location: Wall, NJ Shape: Light Duration:1 minute", "date_time": "6/15/15 22:00", "report_link": "http://www.nuforc.org/webreports/147/S147857.html", "city": "Wall", "state": "NJ", "shape": "Light", "duration": "1 minute", "summary": "4 bright lights weaving in between one another at night.", "posted": "8/23/19"}
{"text": "They were both boomerang shaped and were doing the exact same thing. As I was getting onto I-65 southbound from Cool Springs Galleria I saw, off to the left of my vehicle, two boomerang shaped crafts with many lights, low to the ground at an angle sideways so that I could plainly see the boomerang shape. They were extremely slow moving, almost at a stand still, along the side of a hill. They were both in the exact same position and then they, at the same time, moved so that they were perpendicular to the ground and hovered there. I couldn't slow down anymore than I had, or get off the interstate, so I just kept going and I don't know how long they stayed in the area. This is posted twice, because I accidentally sent in the wrong day the first time, it was actually on March 22, 2006 instead of March 21.", "stats": "Occurred : 3/22/2006 21:07  (Entered as : 03/22/06 21:07) Reported: 3/22/2006 8:42:31 PM 20:42 Posted: 5/15/2006 Location: Franklin, TN Shape: Chevron Duration:", "date_time": "3/22/06 21:07", "report_link": "http://www.nuforc.org/webreports/049/S49778.html", "city": "Franklin", "state": "TN", "shape": "Chevron", "duration": null, "summary": "They were both boomerang shaped and were doing the exact same thing.", "posted": "5/15/06"}
{"text": "A fleet of ships landed in my back garden and took off again. I was woke up early by a humming noise and then large flashes of light filled the room. I suddenly felt weak and over-heated then a fleet of disks, cigars and eggs followed by balls of lightning and fire. Then balls of ice carshed into the carft and I felt frozen. The TV, PC, and other electricals were shut down and all of our magnetic devices were reapeld. They changed colours and shot what we thought were lasers or torch cutters. The objects had a magenta haze and left a cyain trail ( Or the opposit). Two helecopters and a plane were in pursuit of the objects. A gocart with no driver followed them (reason unkown). Then one landed and two weird looking creaturse came out and spoke like a cross of a crabs nipping and a dogs bark. The said the word Mars pefect and got back in there UFO and when it got back into the sky it copied itself and at the same time shrunk. There were no pilots in the aircraft (Human pilots). Then the carft rturned to space with the others. Then my computer started to work and I had emails from my friend saying they saw somthing. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  Probable hoax.  Source of report indicates that he is a \"prep school studant\" (sic). PD))", "stats": "Occurred : 2/6/2006 04:30  (Entered as : 6/2/2006 04:30) Reported: 3/14/2006 9:54:08 AM 09:54 Posted: 5/15/2006 Location: Woodford Green (UK/England),  Shape: Other Duration:30 minites", "date_time": "2/6/06 04:30", "report_link": "http://www.nuforc.org/webreports/049/S49632.html", "city": "Woodford Green (UK/England)", "state": null, "shape": "Other", "duration": "30 minites", "summary": "((HOAX))  A fleet of ships landed in my back garden and took off again.", "posted": "5/15/06"}
{"text": "Planes guided into the Trade Centers by UFOs. I can't believe not many people reported this.   I saw two ufos hit the World Trade Centers.  Is America blind.  The centers went down.  I'm not talking about the planes.  I saw 2 sebarate crafts \"watching\" from the sky.  In the confusion people might have missed it.  They seemed to guide the planes into centers.  Maybe I'm going crazy, but they weren't just spectators.  I saw them while watching the events unfold on TV.", "stats": "Occurred : 9/11/2001 09:00  (Entered as : 9/11/01 10:00) Reported: 4/6/2006 4:04:27 PM 16:04 Posted: 5/15/2006 Location: Erie, PA Shape: Cigar Duration:Many Hours", "date_time": "9/11/01 09:00", "report_link": "http://www.nuforc.org/webreports/049/S49995.html", "city": "Erie", "state": "PA", "shape": "Cigar", "duration": "Many Hours", "summary": "Planes guided into the Trade Centers by UFOs.", "posted": "5/15/06"}
{"text": "Bright green round object quickly travelling east to west. While camping, in sleeping bags watching sky.  Companion was startled by seeing bright green (glow in the dark green) move across sky.   I did not see it and tried to explain that it could have been a meteor or satelite when it or a second appeared about 1 minute after the first and we both saw it.  Appeared dime size, clearly round, moving east to west.  Silent. ((NUFORC Note:  Witness corrected the date to July 15, 1979, not 2006.  The date in 1979 may be approximate, although the witness does not indicate that fact.  The witness describes self as a retired public employee, in a position with considerable responsibility.  We suspect that the witness is a very good, and discriminating, observer.  PD))", "stats": "Occurred : 7/15/1979 23:00  (Entered as : 07/15/2006 23:00) Reported: 4/26/2006 6:56:19 PM 18:56 Posted: 5/15/2006 Location: N. Cascades Nat. Park, WA Shape: Light Duration:2x ~10sec", "date_time": "7/15/79 23:00", "report_link": "http://www.nuforc.org/webreports/050/S50300.html", "city": "N. Cascades Nat. Park", "state": "WA", "shape": "Light", "duration": "2x ~10sec", "summary": "Bright green round object quickly travelling east to west.", "posted": "5/15/06"}
{"text": "1965 Dark Grey Cylinder UFO Updated Statement I just wanted to offer an updated version, the original being:  http://www.nuforc.org/webreports/025/S25728.html  \"Every now and then, my mother and I would take our dog on his night walk to the Parade Ground, a flat park of baseball and football fields. We went there because at the time it was being renovated, and the fields were being partitioned and fenced. This gave us some confidence to allow the dog off the leash to run free for a change.  The Parade Ground is just across Parkside Avenue from Prospect Park. It is August, 1965. I am ten years old.  The dog was having a good run, and once we saw that he wasn't about to run off completely, we relaxed and gazed upwards to view the night sky, trying to find various constellations.  In those days, the street lights in Brooklyn emitted a white light, and not the beige-looking type now in use. If you went to a park, you could get a decent view of the stars, but of course not anywhere near the view if you were upstate in deep woods.  Suddenly, as I looked to the left of me, I saw what I first mentally equated as a submarine perhaps two storeys off the ground higher than the six storey buildings beneath it.  \"Hey Mom, do you see what I see?\" She did.  Here comes this thing, slow and steady and silent. It is huge. It is dark grey - not \"battleship grey,\" but as grey as can be before you rule it black. There is no shine to it.  The front of it was round; I'd seen pictures of submarines, and that is what came to mind. It is actually shaped more like a very long medicine capsule.  As it  proceeded to float past us, we observed its right side. It is solid. It is a perfect and very long dark grey cylinder, and it just keeps coming very slowly and steadily.  Obviously, we can't see the top of it, but so far, we see that even though it is almost black, we sense a light behind the darkness. This does not make sense, as my mother and I later reckoned. The best I can come up with is that my eyes saw dark grey, but my mind knew the cylinder was emitting light. Dark light!  This was no blimp. No lights. No sound. No windows. No gondola beneath. No visible markings. No nothing! It is just a cylinder 300 feet longer than the Intrepid aircraft carrier now docked in the Hudson River going by!  This thing was so huge, that even from the height above me, (200 Feet?) it was clearly visible; visible enough to see even the slightest imperfection clearly, if it had any.  At the same time, we are not in any panic. We are unusually serene. As if it's no big deal somehow. Maybe we were in a stupor beyond awe.  Finally, the end of the ship passes. I ran to see the back of it. I see it is as round as the front with an opening in the center. To this day, I'm not sure if it was square or arch-like. I am convinced that at least the bottom of the opening in the back of it was flat, so it was square or arched. I remember thinking that 3 buses could easily drive inside at the same time. On the other hand, I've seen jets low to the ground on approach to JFK Airport, and thought that \"my\" cylinder was at least 3 times wider at the same height.  This is the only time I experience apprehension. I worry for a moment that whoever is flying this cylinder might see me.  I ran to a to where I could see the other side of the cylinder. It is exactly as perfect and unremarkable as the other side and the bottom.  I have been struggling with my memories for years as to whether there was a single tiny light, blue or red atop the opening in the back. I add this item, but I am not sure. Inside the opening it is absolutely pitch black.  The cylinder was in the order of 1200 feet long. I did not know this at the time. When I saw the cylinder completely, it was \"crossing\" Stratford Road, and the back of it was at Buckinham Road. The distance between these streets on Caton Avenue according to street maps is about 1200 feet.  I rejoined my mother in the original field, and we watched this thing float over the Prospect Park POLICE STATION, heading west until it faded from sight about half a mile west of the Parade Ground. No newspaper, radio, or TV station mentioned it. For that matter, we didn't even tell my father!  As I first accessed the Internet, I ran a search for \"cylinder ufo,\" and plenty of links came up. Even pictures! I wasn't too surprised, because I know damn well what I saw was real, and other people MUST have seen something as well.  I told some close friends. They gave me the jaundiced eye. I could hardly blame them. I guess its just one of those things one must see to believe.\"  Notes:  The Cylinder crossed over Parade Place, and was equidistant between Woodruff and Crooke Avenues.  The Cylinder was about 1/4 the width of the Parade Ground, and travelling in a straight line over the road that runs nearly the length of the park.  Why these single lane streets are designated Avenues is a mystery to me, especially Crooke Avenue, which runs only two blocks.  Modern street maps have re-named Buckingham Road as East 16th street. The equivalent for Stratford Road would be East 11th Street, so by my point of view the cylinder was at least five blocks in length. I need to remark that some internet-based street maps would put the length of the cylinder at 1500-1700 feet. I really should go back there and take measurements myself.", "stats": "Occurred : 8/20/1965 20:30  (Entered as : 08/20/65 20:30) Reported: 3/25/2006 6:33:21 PM 18:33 Posted: 5/15/2006 Location: New York City (Brooklyn), NY Shape: Cylinder Duration:minutes", "date_time": "8/20/65 20:30", "report_link": "http://www.nuforc.org/webreports/049/S49816.html", "city": "New York City (Brooklyn)", "state": "NY", "shape": "Cylinder", "duration": "minutes", "summary": "1965 Dark Grey Cylinder UFO Updated Statement", "posted": "5/15/06"}
{"text": "Hi, I am an avid sky watcher and usually I notice little balls or white and sometimes blue lights traveling slowly overhead.  Even when these objects are still overhead they fade out as if they were moving further away but they will still be directly overhead as I mentioned. The most recent sighting of one of these balls of lights my sister and I were standing out side of her house and I said, \"Hey, there goes one of them things.\"  My sister looked up and noticed it coming our direction. As soon as it got overhead of us it stopped but then after about a three or four second pause the ball of light started moving very erratically from side to side. My sister thought it might be a satellite, but I told her I don't think they move that fast. I was wondering if you have heard anything like this before?  Thank you ((NUFORC Note:  Witness does not indicate date of sighting.  PD))", "stats": "Occurred :    (Entered as : unknown) Reported: 3/21/2006 12:11:10 PM 12:11 Posted: 5/15/2006 Location: Bristol, PA Shape: Light Duration:About 1 min.", "date_time": "unknown", "report_link": "http://www.nuforc.org/webreports/049/S49760.html", "city": "Bristol", "state": "PA", "shape": "Light", "duration": "About 1 min.", "summary": "Hi, I am an avid sky watcher and usually I notice little balls or white and sometimes blue lights traveling slowly overhead. Even when", "posted": "5/15/06"}
{"text": "Reported in a London paper in 1762:   A bright light in the form of a straight line eight moon diameters long, one diameter wide. I do not know if this counts as a proper UFO report, but I have in my possession a copy of The London Chronicle (also called the Universal Evening Post) dated Thursday December 23rd 1762, whose front page carries a report which I have copied and will email, referring to an obseved phenomenon at Lulworth, Dorsetshire, on December 11th, 1762, at 9pm.  Described as \"a sudden & radiant light which overspread the earth and sea, equal to the splendour of the noonday summer sun; looking directly perpendicular over us, we saw an appearance refulgent as the sun itself, in form straight as a line, about eight times the diameter of the full moon in length, in breadth not an eighth part of its length; the duration about a minute.   Afterwards it altered its position, and changed into a serpentine form to terminate in smoke.\" ((NUFORC Note:  We express our gratitude to the gentleman who submitted the report, and for the copy of the article.  The article is written in such a manner as to make us wonder whether the event might have been the result of a meteor, but that is pure conjecture on our part.  The reference to smoke is redolent of a meteoric event, we believe.  PD))", "stats": "Occurred : 12/11/1762 21:00  (Entered as : 12/11/1762 21:00) Reported: 4/13/2006 2:00:53 PM 14:00 Posted: 5/15/2006 Location: Lulworth, Dorsetshire (near) (UK/England),  Shape:  Duration:>1 minute", "date_time": "12/11/62 21:00", "report_link": "http://www.nuforc.org/webreports/050/S50113.html", "city": "Lulworth, Dorsetshire (near) (UK/England)", "state": null, "shape": null, "duration": ">1 minute", "summary": "Reported in a London paper in 1762: a bright light in the form of a straight line eight moon diameters long, one diameter wide.", "posted": "5/15/06"}
{"text": "A child hood experiece seems more real like an alien encounter then the \"dream\" I thought it was For 65 years or more I've thought of this experience as a bad, bad nightmare.  The more I think of it the more it seems it was not a dream.  It was the most frighting thing in my life.  I was about 4/5 years old when the first occurrance happened.  Two/three  creatures appeared in my bedroom at night.  They just came thru the wall and where there.  I was scared to the point of hysteria.  The next thing I remember is we where going down the street away from my house towards the nearest corner.  There was their \"car,\" as I thought it was.  I noticed it was shiny like polished alumimun (not black like all the other cars I'd ever seen) and it appeared to me to be upside down!  The flat part was on top and the curved part on the bottom, like a half sphere upside down. They wanted me to get in and I guess I did although I can't recall.  After that I was afraid to go to my room to sleep because I was fearful they would come back to take me.  I think they returned maybe 4 times.  I was always near frighted to death each time.  As best I can recall this was over a period of about 1 or 2 years.  Then they stopped coming.In my pre and teen years I was very prone to nose bleeds.  This in its self was not remarkable except for one occurrence. I was having a particularly heavy nose bleed. and was leaning againist a building letting it just run freely.  Some thing came out of my nose and fell to the ground.  I didn,' pick it up because it was all bloody, but it was maybe a half to one inch long and shaped like a bullet.  I've always wondered about that.  I am now 72 years old and have never spoke of this to anyone.  Am I nuts or imagining some thing??     My name is ((name deleted)) ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/15/1936 00:00  (Entered as : 071536 0.00) Reported: 3/13/2006 9:53:56 PM 21:53 Posted: 5/15/2006 Location: Alma, MI Shape: Disk Duration:unkn", "date_time": "7/15/36 00:00", "report_link": "http://www.nuforc.org/webreports/049/S49620.html", "city": "Alma", "state": "MI", "shape": "Disk", "duration": "unkn", "summary": "A child hood experiece  seems more real like an alien encounter then the \"dream\" I thought it was", "posted": "5/15/06"}
{"text": "Looked like airplanes without windows, wings, or tails. About 9pm on a clear night in late July or August of 1947.  Several people out in the road looking up at two metalic objects silently circling overhead.  Some men walked down the road to get a closer look,  but the objects moved as they approached.     No record in local newspapers,  Many years later,  people we remember being in the crowd seem to not recall the event.  As if the entire town has developed amnesia about the objects. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/15/1947 21:00  (Entered as : 07/??/47 21:00) Reported: 3/12/2006 8:44:43 AM 08:44 Posted: 5/15/2006 Location: Morehouse, MO Shape: Cylinder Duration:hours", "date_time": "7/15/47 21:00", "report_link": "http://www.nuforc.org/webreports/049/S49557.html", "city": "Morehouse", "state": "MO", "shape": "Cylinder", "duration": "hours", "summary": "Looked like airplanes without windows,  wings, or tails.", "posted": "5/15/06"}
{"text": "01/20/51     Palm Springs CA     light     hour and a half     bluish-white light of worm-like shape        04/09/06 Edmund C. Jaeger, a well-known naturalist and reliable observer, records an unusual event in his field notes:  On January 20, 1951, at 04.30, he wakes in Palm Springs, California, to see a bluish-white, needle-shaped object in the western sky at about 30 degrees. This is between the constellations Leo and Cancer.  As he observes the object for the next hour and a half, it develops a head and a tail and goes through various worm-like shapes.  He comments: \"I never before heard or saw anything like it.\"   A writer of books on natural history, Jaeger was a scientist and a reliable observer.  I am writing a book about him and would very much like to comment on this anomalous event.  The curious thing is that I could find no witnesses, no newspaper accounts, or other record of the event.  May I have your guidance and comment on this?", "stats": "Occurred : 1/20/1951 04:30  (Entered as : 01/20/51 04.30-06) Reported: 4/9/2006 8:59:11 AM 08:59 Posted: 5/15/2006 Location: Palm Springs, CA Shape: Cigar Duration:one and a half hours", "date_time": "1/20/51 04:30", "report_link": "http://www.nuforc.org/webreports/050/S50060.html", "city": "Palm Springs", "state": "CA", "shape": "Cigar", "duration": "one and a half hours", "summary": "01/20/51     Palm Springs CA     light     hour and a half     bluish-white light of worm-like shape        04/09/06", "posted": "5/15/06"}
{"text": "My sighting of two objects in Chicago, IL as a pre-teen in the early 50's This event happened when I was a young boy, just pre-teen when I'd guess I was about 12.  I'm now 65 and want to leave this report before I can't.  This would put the event in the very early 50's.  I lived in a south suburb of Chicago (on a small farm), about 20 miles SSW of downtown.  The township was Calumet Park, IL.  One afternoon I was standing in the yard looking due North.  Suddenly coming out of the west there was a very high, extremely fast round object moving west to east.  The speed was unlike anything I had ever seen.  Many times that of the fastest plane.  From the ground the view angle was probably about 60 degrees.  From my distance it appeared to be about three or so times the size of a pin head held at arm's length.  When it was due north of my location it suddenly came to a stop, motionless.  It remained that way for several minutes.  Then another identical object came from the East at the same blazing speed.  It came to a stop right by the other one.  Now there were two of the round objects together.  They hovered for a few minutes.  Then they went straight up, got smaller and smaller until I couldn't see them any more.  There was no sound, no vapor or contrails.  The day was bright and clear, not a cloud in the sky.  No wind.  Just a perfect summer day.  I remember the temperature being plesant too, which would normally mean early summer or late,late spring.  In the above part of the form I'm only guessing month-day-year. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/10/1952 12:00  (Entered as : 06/10/52 12:00) Reported: 3/14/2006 10:48:11 AM 10:48 Posted: 5/15/2006 Location: Chicago (south suburb), IL Shape: Circle Duration:10 minutes", "date_time": "6/10/52 12:00", "report_link": "http://www.nuforc.org/webreports/049/S49634.html", "city": "Chicago (south suburb)", "state": "IL", "shape": "Circle", "duration": "10 minutes", "summary": "My sighting of two objects in Chicago, IL as a pre-teen in the early 50's", "posted": "5/15/06"}
{"text": "Flaming ball of light making right angle turns seen from front porch on a hot summer's night. It was a very hot summer evening and seeing as how we did not have air conditioning my older sister, younger brother and I were permitted to sleep on our front porch, since it was cooler than our bedrooms.  Since this occurred so many years ago, the actual year could have been 1954 or might have even been 1956.  In any case, I was 8 or 9 years old at the time.  Around 1:00 A.M. in the morning, I had to get up and use the bathroom.  I know it was around 1:00 A.M. because our clock struck the hour before I went back out onto the front porch.  As I was settling back down to go to sleep, I heard what could be likened to the sound of an 18 wheeler when it shifts down to a lower gear, and there was also a hissing sound like steam.  I sat up and since I thought it was a truck coming down our little side road, I wanted to see that unusual sight.  Imagine my shock when instead of a truck, there in the sky was a fireball.  It was skimming along just above the trees lining a creek on the other side of the road.  It made a sharp right angle turn, and after it moved off perhaps 75 feet or so, it looked like it was dripping something flammable from beneath it.  Suddenly it stopped.  And just as I thought to myself....\"uh oh, they see me\"....  The next thing I remember is sitting on the front porch, and somehow the craft had already moved off some distance.  I tried to wake up my sister, but by the time I got her to wake up, it was out of sight.  The strange thing about this whole ordeal, was that it was already beginning to get light outside when I watched this craft move off.  I went from 1:00 A.M. to daylight without any memory.  I told my mom about what happened, and she only suggested that I not tell anyone about what had occurred...and I haven't until now.  I am now married, retired, and no longer live in Missouri, and I don't see where this information is going to hurt anyone; and perhaps someone will find it useful or interesting.  If not, that is okay too. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 8/8/1955 01:00  (Entered as : 08/08/55 1:00) Reported: 5/8/2006 7:12:18 PM 19:12 Posted: 5/15/2006 Location: Independence, MO Shape: Fireball Duration:several hrs.", "date_time": "8/8/55 01:00", "report_link": "http://www.nuforc.org/webreports/050/S50478.html", "city": "Independence", "state": "MO", "shape": "Fireball", "duration": "several hrs.", "summary": "Flaming ball of light making right angle turns seen from front porch on a hot summer's night.", "posted": "5/15/06"}
{"text": "5/16/1958/ 1500 hours/ just getting dark,mount arity forest diamond shape,10 ft tall 6ft wide, you could see threw it,wooded area,when sun light hit it,it gave off different colors. camping in woods ((NUFORC Note:  Witness provides no other information.  Date of event may be approximate, although the witness does not indicate that fact.  PD))", "stats": "Occurred : 5/16/1958   (Entered as : 05/16/58) Reported: 3/28/2006 9:02:03 AM 09:02 Posted: 5/15/2006 Location: Cincinnati, OH Shape: Diamond Duration:24 hours", "date_time": "5/16/58", "report_link": "http://www.nuforc.org/webreports/049/S49850.html", "city": "Cincinnati", "state": "OH", "shape": "Diamond", "duration": "24 hours", "summary": "5/16/1958/ 1500 hours/ just getting dark,mount arity forest", "posted": "5/15/06"}
{"text": "children see flying saucer in small East Texas town The day and the year of this sighting is a guess.  At the time of the sighting, I am guessing my age to be eight or nine years old.   My nephew and I were outside in front of my home at dusk. We were lying in the grass beside the road.  We would jump up as a car drove by and attempt to scare the drivers.  We were children and weren't being watched closely!  While waiting for the next car, a \"flying saucer\" slipped from NNE to SSW at tree top level.  I can still see that saucer clearly in my mind after all these years.  It made no sound.  It made a Z movement as it slipped through the air. That Z movement impressed me, because in 1995 when I saw my second UFO, it made that same Z movement.  My nephew was no younger than two but probably not yet four when we saw the saucer.  He remembers it. He had to be old enough to talk, because when we saw it, we turned to each other and yelled, \"UFO\"!  We also had to have heard \"UFO\" on the television or radio for us to know that term!   We ran into the house, but neither of us remember what happened after that and there is no one left alive who could tell us.  The only difference in our memory of this sighting is that he remembers windows in the saucer and I don't. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 8/1/1959 18:00  (Entered as : 08/01/59 18:00) Reported: 3/21/2006 9:25:54 PM 21:25 Posted: 5/15/2006 Location: Golden, TX Shape: Disk Duration:3 seconds", "date_time": "8/1/59 18:00", "report_link": "http://www.nuforc.org/webreports/049/S49768.html", "city": "Golden", "state": "TX", "shape": "Disk", "duration": "3 seconds", "summary": "children see flying saucer in small East Texas town", "posted": "5/15/06"}
{"text": "Stationary Lights Over Portland OR Around 1960 Talking with a friend about the recent sightings (April 29/30, 2006), I thought the following might be of topical inerest although it was a long time ago and I don't recall the exact date.  Looking out of our picture window towards the SE, on a hill in SW Portland, my Dad, my Mother and myself saw in the evening sky what I remember to be 3 stationary oblong lights hovering over the Wilamette Valley.   They remained there at least for 10 minutes, and my father called  -- I believe -- the Oregonian to report it.  I remember that the paper said they had received a number of calls on it.  I also remember that the paper printed a squib about it after that, basically saying that stationary lights were observed over the city and that the Air Force was notified, and that the Air Force indicated that it would look into it.   I don't recall any followup on the story. I just wish I had more of the facts. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/1/1960 20:00  (Entered as : 07/01/60 20:00) Reported: 5/7/2006 4:14:31 PM 16:14 Posted: 5/15/2006 Location: Portland, OR Shape: Unknown Duration:15-30 min", "date_time": "7/1/60 20:00", "report_link": "http://www.nuforc.org/webreports/050/S50454.html", "city": "Portland", "state": "OR", "shape": "Unknown", "duration": "15-30 min", "summary": "Stationary Lights Over Portland OR Around 1960", "posted": "5/15/06"}
{"text": "Observed strange large disk like craft. Observed a strange \"craft\" in a local golfcourse/reservation area.  Was not a commercial aircraft.  It landed and appeared to hover over the ground, was very large and was emitting a strange whirling sound and eletrical looking sparks. There were no markings visible are lights on \"craft,\" the craft itself was very dark colored. A very scary experience. Saw by four people, and they were all quite terified. It suddenly shot upwards, and disappeared or vanished just above tree line. Left behind something similiar to a vapor trail. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))", "stats": "Occurred : 8/1/1960 18:00  (Entered as : 08/60 18:00) Reported: 3/16/2006 8:08:18 PM 20:08 Posted: 5/15/2006 Location: Boston, MA Shape: Disk Duration:30 minutes", "date_time": "8/1/60 18:00", "report_link": "http://www.nuforc.org/webreports/049/S49679.html", "city": "Boston", "state": "MA", "shape": "Disk", "duration": "30 minutes", "summary": "Observed strange large disk like craft.", "posted": "5/15/06"}
{"text": "Observation of spherical white colored craft in geostationary position for 1 hour plus. The altitude at a guess at 2,000 feet high. This was seen on September 4, 1962 at 3:30 pm Central Standard Time. Location of sighting was 2.6 miles south of St. Louis Lambert airport. The sky was clear and wind was calm. My mother was hanging clothes out to dry, and called out to me to come out and see the object. I rejected her offer for some time, but she insisted that it was  something I should see. When I finally went out and saw the object we talked and she asked if it could be Venus? I told her that it could not be because of the time of day and direction was eastward. I was a member of the St. Louis Astronomical Society at this time. My mom said I should get my telescope and take a look. At the age of 15 I wasn't totally coordinated yet, and I broke the front glass out of the front screen door. Trying to get the telescope out the door. I'm adding for the time frame. It took a bit of work to gather the broken glass up before a got the telescope to the back yard. Setting up the telescope. It was a Tasco refractor 60 mm objective lens, with a alt-azimuth mount. I first used the wide angle eyepiece to spot the object. I found it magnified well, but still rather small. I let my mom look through the scope and by this time we had the next door neighbors over also. So now we have our own star party. Three adults and one kid. I let everyone take there time and look. Of course they all asked if I could get it bigger. I set the 3 X barlow and the strongest eyepiece. This set the magnification of 525 power. When I looked at the object it nearly filled the entire field of view.  I can only explain that I had it focused perfect!  It looked like a cue ball.  No markings.  Perfectly smooth and rather off white, not shiny.  It did not give any glow off.  No sense of spinning motion, and no noise at all. This is important. This object has not moved one nanometer in an hour of time. Nothing in the heavens or earth can do that!  When you view the moon at full power with that telescope it's like a big train moving by. This didn't move. I expected it to move and was in total disbelief at what I was seeing. I let my mom and the neighbors husband and wife both take long looks at the object and we all agreed that it was not moving. I kept saying this can't be happening! No one is going to believe me at the next Astronomical meeting. But I got witnesses!  Better yet I've done lunar eclipse photos, and said I will be getting my camera and special eye mount for it and I'll be back. Never had a chance to move. When we look back at the time in history, it was as one of the worst in nuclear confutations. The \"Cuban missile crisis\" was happening. I no sooner said that I was going to get the camera when I hear a very load jet aircraft take off. Living for many year near the airport we grew accustomed to the different sounds of the commercial, and air force aircraft flying and even crashing near by as a F-86 did a mile down the road. This was the sound of afterburners and full throttle. As soon as the plane came above the tree line I spotted it as a B-47. She was doing a tight circle as we literality turned our bodies around as it circled and climbed for altitude. On the second sweep around I was beginning to wonder if it had something to do with our visitor in the sky above. I was a lucky hunch, because at that very moment I scream! Look it moved! What had been stationary for an hour did a sudden straight vertical movement to twice the altitude in a split second and stopped. The B-47 was still in hot pursuit with all engines at full throttle. It kept a circular pattern as she climbed up toward the object. After about the fourth revolution around the B-47 chase was over. I saw the object go from that second position to ascend straight up out of sight. My mom insisted that I report this to the Air Force base at Lambert Field. I looked up a few numbers that sounded official and dialed them. When I mentioned I wanted to report a UFO, they responded I could get in a lot of trouble doing this. Did my parents know I was doing crank calls to the US Government? The last call I made I did get through to an Air Force official and said I wanted to report a UFO and it was being chased by a B-47. He said that's ridicules there's no B-47 aircraft in the air. I said if you don't believe me look out your window. He hung up quickly.  No report was ever made to the papers that I could ever recall. Iwould like to know if anyone in the St. Louis area saw this object also.", "stats": "Occurred : 9/4/1962 15:30  (Entered as : 09/04/62 15:30) Reported: 3/29/2006 4:25:52 PM 16:25 Posted: 5/15/2006 Location: St. Louis, MO Shape: Sphere Duration:1 Hour plus", "date_time": "9/4/62 15:30", "report_link": "http://www.nuforc.org/webreports/049/S49863.html", "city": "St. Louis", "state": "MO", "shape": "Sphere", "duration": "1 Hour plus", "summary": "Observation of spherical white colored craft in geostationary position for 1 hour plus.", "posted": "5/15/06"}
{"text": "bal of fire in the sky no reported air crashes that night(unexplained) My cousin said she saw points of light then the ball of fire..I saw the ball of fire when we walked upstairs, the huge  ball of fire caught my eye and we couldnt believe our eyes we called the police.  it was a huge mass of fire in a ball formation and then suddenly disappeared in to thin air.  We told my Aunt ((name deleted)) my cousins mom ...she was watching \"Peyton Place \" an old night time soap so what ever time that used to come on she was watching it in the dark.   so the light was very visible...we both saw it.   Later on that month a man from the military or somewhere went to harding school in El cerrito and told us they have seen UFO activity over Albany Hill...Which is next to the old Berkeley dump  right where Id seen the ball of fire in the sky.   Thank you for your time and listening.", "stats": "Occurred : 1/10/1964 20:00  (Entered as : 01-10-1964 20:00) Reported: 4/24/2006 8:44:42 PM 20:44 Posted: 5/15/2006 Location: El Cerrito (over Old Berkeley dump), CA Shape: Fireball Duration:2 minutes", "date_time": "1/10/64 20:00", "report_link": "http://www.nuforc.org/webreports/050/S50277.html", "city": "El Cerrito (over Old Berkeley dump)", "state": "CA", "shape": "Fireball", "duration": "2 minutes", "summary": "bal of fire in the sky no reported air crashes that night(unexplained)", "posted": "5/15/06"}
{"text": "Round, silver object hovering overhead, three witnesses My family lived 6 miles southeast of Guernsey - my father was transferred there in 1963.  Although I'm not sure of the exact date (1964 or 1965), my brother and one of his friends were wrestling in our front yard - I was about six or seven years old and my brother and his friend would have been 9 or 10.  I walked around the corner of our house to where they were wrestling on the lawn.  All of the sudden they stopped wrestling and stood straight up.  At the same time all three of us looked directly above us.  There, hovering, was a large, round, silver object directly above us.  It was low enough that I could make out what looked like dimples in the skin of the object - almost like hammered metal.  Since it was right above us, I don't know whether it was a sphere, or whether we were just looking at the bottom side of a saucer shaped object.   As we watched the object it slowly moved behind a cloud. We watched the cloud for a long time and as it dispersed we realized the object was gone. My entire family loves airplanes and anything to do with space. My parents used to wake us in the middle of the night when important things were happening with Mercury/Gemini/Apollo, and were being televised. I knew that what we saw that day was very strange. At the time I don't know whether we had ever heard the term UFO, but have realized in my adult life what we saw. In the following years my father also saw very strange objects on two different occasions. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 5/1/1965 13:00  (Entered as : 05/01/65 13:00) Reported: 5/8/2006 11:32:36 AM 11:32 Posted: 5/15/2006 Location: Guernsey, WY Shape: Sphere Duration:1 minute", "date_time": "5/1/65 13:00", "report_link": "http://www.nuforc.org/webreports/050/S50473.html", "city": "Guernsey", "state": "WY", "shape": "Sphere", "duration": "1 minute", "summary": "Round, silver object hovering overhead, three witnesses", "posted": "5/15/06"}
{"text": "Glowing orange sphere, stationary and silent My brother and I both had paper routes and had just left our apartment building to go pick up our papers. This was several years ago (1966) in the early morning hours. This object was circular and was orange in color. It was about the size of the moon when the moon is overhead. ' I told my twelve-year-old brother to look and he looked up and said that it was probably the moon. It wasn't the moon because the moon was elsewhere in the sky, low but not on the horizon. I didn’t know what to make of it as it was stationary and glowing orange from dim to bright. The intensity of the light was not extremely bright closer to dim but clear. It only appeared for a short time probably 30 to 45 seconds and the disappeared. There was no sound associated with it. I have thought of this from time to time over the years and have tried to think of what it could have been. The only thing I could ever come up with was a UFO. This all took place in Columbus, Ohio on the west side of what was then called Westgate Manor We lived at ((deleted)) Briggs Road. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 8/1/1966 05:30  (Entered as : 08 1966 05:30) Reported: 3/12/2006 2:14:38 PM 14:14 Posted: 5/15/2006 Location: Columbus, OH Shape: Circle Duration:Seconds", "date_time": "8/1/66 05:30", "report_link": "http://www.nuforc.org/webreports/049/S49573.html", "city": "Columbus", "state": "OH", "shape": "Circle", "duration": "Seconds", "summary": "Glowing orange sphere, stationary and silent", "posted": "5/15/06"}
{"text": "I noticed a light that appeard to be above the Sepulveda Mullholland pass area. The light moved vertically and horizontally stopped and hovered. I thpught it wa a helicopter and I just kept watching it. It started to moved closer to my location. It moved so close that I could make out the shape and color. It was triangluar inshape with rounded corners. It appeared to be a light of white body color and had resessed round lights the pulsated around the base and changed color and intensity of color as it moved around the base of the craft. the color og the lights changed from white to variations of yellow then light green getting progressively darker green then pink to various shade of pink to red. I went outside to get a closer look. there was no sound no wind it was huge relative to my frame of reference and possibly 20 stories up. the craft hovered over our location for 30 seconds and then moved off. I went upstairs to tell  my parents and to see if they had seen it. They had no and by the time we alerted them it was just another moving lightinthe sky. We did not reportit at the time beause the police would assume that we were a couple of stoned teenagers.  Side note;  Many many years later I brought the subject up to my parents again. My father mentioned that he as a youth had seen a UFO in Illinois. I asked him to describe what he saw and he described the same object I had seen. Parents particulary fathers are not inclined to remember the ravings of a 16 year old girl.  I can only conclude that we saw the same object several decades apart.  I apologize for the very delayed reporting of this but I only just found out about you. thank you so much for all of your hard work and dedication. As for myself all I can say is the question of whether or not there are UFO's is one question I do not have to wrestle with . The answer is yes and it was not a UFO for I identified it.  Thank you again ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 9/20/1967 21:00  (Entered as : 9/20/67 21:00) Reported: 3/13/2006 7:27:28 PM 19:27 Posted: 5/15/2006 Location: Woodland Hills, CA Shape: Triangle Duration:5 minutes", "date_time": "9/20/67 21:00", "report_link": "http://www.nuforc.org/webreports/049/S49617.html", "city": "Woodland Hills", "state": "CA", "shape": "Triangle", "duration": "5 minutes", "summary": "I noticed a light that appeard to be above the Sepulveda Mullholland pass area. The light moved vertically and horizontally stopped and", "posted": "5/15/06"}
{"text": "Unknown light/object moving perpendicular/horizontal in seconds and disappearing then reappearing At about 5PM in June, 1968, I was in the car with my mother driving east on River Knolls Drive.  As we reached the crest of the hill that led down to our home, I noticed a white/silvery light in the distance over the trees as we looked almost due east (or barely southeast). There was nothing else in sky as it was a clear summer day and I called attention to this unknown light to my mother.  She was surprised at the light and pulled the car over to the side of the road and we began watching the light in the distance(it was off in the distance but I can only guess 10-20 miles away.  When I first spotted this light what caught my attention was the fact that it was at times stationary but would then move up in a direct perpendicular line and would then sometomes move sideways in a direct horizontal line. These movements were in the blink of an eye and guessing at the distance I would say these horizontal and perpendicular movements were many miles in seconds.  We watched this movement for about 15 minutes and the mental image I have is of this unknown light/object making a cross or plus sign in the sky.  As we watched this movement we both commented and agreed that there was nothing we knew of on this earth that could move and change directions so quickly and stop in an an instant.  As we were watching this movement for about 15 minutes all of a sudden the light blinked out. This surprised us and we were going to proceed on home when the light blinked back on and reappeared in about the same spot as we originally saw it.  It made a few more horizontal/perpendicular movements and blinked out again and did not reappear. The total duration of this event was about 20 minutes.  My mother and I were perplexed at this event because we had no explanation for what we had seen.   I was 16 years old at the time and never forgot those amazing 20 minutes. I do know that reporting this 38 years later I can recall the incident as if it had happened 5 minutes ago. ((NUFORC Note:  Date in June 1968 is approximate.  PD))", "stats": "Occurred : 6/15/1968 17:00  (Entered as : June, 1968 17:00) Reported: 4/17/2006 7:13:40 AM 07:13 Posted: 5/15/2006 Location: Louisville, KY Shape: Unknown Duration:20 minutes", "date_time": "6/15/68 17:00", "report_link": "http://www.nuforc.org/webreports/050/S50150.html", "city": "Louisville", "state": "KY", "shape": "Unknown", "duration": "20 minutes", "summary": "Unknown light/object moving perpendicular/horizontal in seconds and disappearing then reappearing", "posted": "5/15/06"}
{"text": "Livingston NJ UFO sighting, Time stopped! I was eight years old when this event occurred, I was sitting with my baby sister in a pontiac convertible while my brother was sitting in the front seat with my Mother. We all had mixed emotions. My Mom was frightened, I wished to leave the car, and she kept screaming for me not too! She recently died.  Until now I was not allowed by my family to discuss the event. We held it in our family. My brother has zero problems talking about this, nor my sister but my Mom was frightened to a point where she tried to speed away in our car, however time stopped, we could not move! It was really fascinating I thought?  I knew all about UFO encounters as my father was in the Korean war and the US Air Force.  This occurred while we were heading home from my grandmothers home in Short Hills, NJ on Old Short Hills Road prior to reaching Walnut Street in Livingston. I remember the UFO was hovering near the property that had a hidden resevoir behind it, and alot of power lines. I lived on the East Orange Resevoir in Livingston NJ and knew that some people thought UFO's where seen near water, so I was use to going and playing and ice skating on the resevoir and had zero fear, however my Mother would not allow the door to open and the car only had two front doors, and she remained fixed behind the wheel of the Pontiac convertible. I asked her years later why this scared her and she refused to speak ever about it.   However when I arrived home to Baker Road, I phoned my Dad whom worked in the Menlo Park Mall in Edison he owned a furniture store there.  He was working late that night.  I do recall we left during semi-daylight and arrove home in the dark!   He told me to call the Morristown Airport and report it! I did, at a small age, I never forgot this experience and have had an insatiable yet calm interest and patience abpout this topic.  I was married in 1977 at the young age of 17 years old, and when I told my future husbands Mother about how I had witnessed a UFO, she declared,\" Wow, I saw it along with most of my eight children and my husband, who at that time worked for Bell Labs in NJ,  My Dad was working close to the Thomas Edison Labs in Edison NJ at that time.  We always wondered, if this UFO had something to do with the fact we did marry and have a son?  Many years later yet young as teens. I do truly believe that the UFO's come out of the Bermuda Triangle and are seen by many.  I saw on the news in the 1990's UFO's hovering over Phoenix, that was not like our experience.  Time stopping, I remember the exact clearing in the woods where this occurred, the exact home it happened in front of too. It is amazing to me that I am now 47 and this still perplexes me although I realize my Mom was aware of military interogation, blue book files etc, from my Father collecting Time Magazines, and the fact he always was into the paranormal!  Alot of people in my immediate family saw this occur, aprox 13 of us are alive to talk about it.  I have drawn it, however do not share it. I feel that we all have individual incounters and that they may be helping or hurting us? I do not want to open a pandora's box. I feel this is how my Mom was protecting me and my siblings, or I could have been reporting a encounter of the third kind or missing! I am glad I am not doing that. I wish all of you success. Do you realize that the UFO's are hanging out near the USA submarine bases? Look on the World Map? I do not know but would like to if they are hanging around other countrys submarine bases? They are built by General Dynamic's and Electric Boat, the fact that our Star Wars program has begune makes me feel like I just may see one soon, since I live near the Bangor Wa submarine base now? Who knows? It can not be a cooincidence, your tracking is excellent in my mind. Keep up the fantastic work and I will report any others I happen to see, to the US Navy or Marines since my son is a US Marine he told me I may have had response had I called them in NJ, way back when I was a little girl. True story, no additions. The craft was circular and looked invisible however you could see windows and lights. Within the circle. when I was interogated by my Dad in a most professional way, and this is more then likely why I have such a memory! I told him exactly what I am telling you, This craft flew over us, and then all of the cars behind us could move, and my Mother could have had a speeding ticket~! However we got home safe, and I wrang Dad He was excited and wanted to know more, at such a young age I was allowed to stay up late and explain and try and draw what I saw! It was round, perfectly, looked to have some sort of craft in the center, like if it were spinning or creating a temporary worm hole? It had beings in it, as they gazed at me out of tiny slits, within the outer ring, sort of how Jupiter has rings this one had one bright light ring belt around it.the center looked like an inverted bubble, unlike all of the drawings my Father had seen elsewhere mine was upside down? He did not question me. I still stick to seeing what I did indeed see, my brother remember it too. I have not asked my little baby sister because I do remember she was in a car seat at this time, so she was a baby of around two, it would definitely be in her memory from Dad bragging that his wife and family saw a UFO for real!", "stats": "Occurred : 6/15/1968 18:00  (Entered as : 1968 18:00) Reported: 4/17/2006 10:43:37 PM 22:43 Posted: 5/15/2006 Location: Livingston, NJ Shape: Disk Duration:time stopped", "date_time": "6/15/68 18:00", "report_link": "http://www.nuforc.org/webreports/050/S50171.html", "city": "Livingston", "state": "NJ", "shape": "Disk", "duration": "time stopped", "summary": "Livingston NJ UFO sighting, Time stopped!", "posted": "5/15/06"}
{"text": "Egg shaped object lit-up like the moon. Time and date are approximate. I was about 8-years old at time of sighting. Myself and a group of 5 or 6 boys were playing football in a open field at the time of sighting. It was still daylight but just getting toward dusk. Sky was clear and blue. We all seemed to notice at about the same time an egg or oval shaped object slightly smaller than a dime held at arms length. The object moved across the sky in a more or less straight line from west to east. The entire object was luminescent. As if you were looking at the moon. There was no sound and no other type of lights on object. It moved at a leisurely pace across the sky and was in sight for about 5-10 seconds. Always wondered what it was that we saw that day. I still don't know. CORRECTION:OBJECT WAS SIGHTED IN YORK,PENNSYLVANIA-NOT MARYLAND.SORRY ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/20/1968 19:00  (Entered as : 06/20/68 19:00) Reported: 4/25/2006 5:51:05 PM 17:51 Posted: 5/15/2006 Location: York, PA Shape: Egg Duration:5-10 seconds", "date_time": "6/20/68 19:00", "report_link": "http://www.nuforc.org/webreports/050/S50290.html", "city": "York", "state": "PA", "shape": "Egg", "duration": "5-10 seconds", "summary": "Egg shaped object lit-up like the moon.", "posted": "5/15/06"}
{"text": "I was 6 years old when I saw a ufo diamond shape with gray color and purple light hovring in sky moving at first slowly and  suddenly skip with unbelivable speed disapearing in sky of Tehran Iran. ((NUFORC Note:  Date of event may be approximate, although the witness does not indicate that fact.  PD))", "stats": "Occurred : 7/10/1968 20:30  (Entered as : 07/10/1968 20:30) Reported: 4/2/2006 6:22:56 PM 18:22 Posted: 5/15/2006 Location: Tehran (Iran),  Shape: Diamond Duration:20 second", "date_time": "7/10/68 20:30", "report_link": "http://www.nuforc.org/webreports/049/S49927.html", "city": "Tehran (Iran)", "state": null, "shape": "Diamond", "duration": "20 second", "summary": "I was 6 years old when I saw a ufo diamond shape with gray color and purple light hovring in sky moving at first slowly and  suddenly s", "posted": "5/15/06"}
{"text": "Fireball and  missing time It was a warm august night at around 6/7pm  Myself my brother and a friend were standing outside of cunningham school we were talking as we sat on the bike rack suddenly our friend yells out LOOK! we couldn't believe our eyes a gigantic orange fire ball shot across the sky  from east to west you could see the flames licking off of it leaving a smoke trail, it looked so close to us you could say it was likes a medicine ball flying across the sky on fire. we ran to the other side of the building which was only about 60 feet long but it was gone we ran to our friend house behind the school and talked his mom into chasing after it we drove down landis ave heading west for about 15 minutes but could not find it again suddenly it started raining pouring down tourents of rain for about a half hour,we headed back to our friends house my brother and headed home mom was really ticked off we asked why she said we were late for our curfew we looked at each other and tried to tell her we were only gone from the house for about an hour we looked at the clock it was 10:30 pm we looked at each other we were sent to bed we talked all night about how we lost an hour and a half we went back to our friends house the next day and asked our friend what time did this happen last night he said  around 7/7:30pm when we asked our friends mom she told us  we came in at around 9:30pm we all looked at each other. I'm 45 years old now I was talking to another old friend about that night and he told me that he and my older brother (5 years older than me) saw the same thing on the same night back in 1968. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 8/10/1968 19:00  (Entered as : 8/10/1968 19:00) Reported: 3/13/2006 11:41:15 PM 23:41 Posted: 5/15/2006 Location: Vineland, NJ Shape: Fireball Duration:10 to 20 sec.", "date_time": "8/10/68 19:00", "report_link": "http://www.nuforc.org/webreports/049/S49624.html", "city": "Vineland", "state": "NJ", "shape": "Fireball", "duration": "10 to 20 sec.", "summary": "Fireball and  missing time", "posted": "5/15/06"}
{"text": "It was a full moon when my brother and I observed 100 yards away for 5 minutes above the tree topics a metalic saucer shaped craft with colored lights, yellow, green, red, blue that flickered with the craft making no noise, going backwards and forwards, remaining stationary and then taking off extremely fast. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/1/1969 21:00  (Entered as : 1969 21:00) Reported: 4/3/2006 7:15:39 PM 19:15 Posted: 5/15/2006 Location: Lawrenceburg, KY Shape: Disk Duration:5 minutes", "date_time": "6/1/69 21:00", "report_link": "http://www.nuforc.org/webreports/049/S49947.html", "city": "Lawrenceburg", "state": "KY", "shape": "Disk", "duration": "5 minutes", "summary": "It was a full moon when my brother and I observed 100 yards away for 5 minutes above the tree topics a metalic saucer shaped craft with", "posted": "5/15/06"}
{"text": "UFO over Orangevale, CA in May/June 1969 My fiance had 2 friends over and they were in sleeping bags in his backyard.  They were just falling asleep when the backyard was lit as bright as noon on a sunny day. My fiance also told me all three guys mentioned that their zippers and/or metal buttons on their clothing and sleeping bags got very warm. There was no noise, just the intense light.  They darted into the house and tried to watch whatever it was out of the patio door. They never saw a \"shape\", just the light beam at that point. After it moved away, my fiance ran down to the house where I was staying while my mother was at my grandmother's funeral.  He tapped on the window and when I awoke, he told me what they had just seen.  I got dressed and joined him in a grassy field across from his house and we watched as this bright light moved slowly around the Orangevale area (very rural in 1969).  As it moved, it shot a beam of light down every once in awhile.  We heard various animals make noise in the area the beam was shining.  We watched this for several minutes, then I told my fiance to call McClellan AFB in North Highlands, CA since that is where my step-father was currently stationed.  He did but they claimed they didn't know anything about the object we were seeing in the sky so they referred us to Mather AFB. We called them but they claimed the same thing.  We no sooner got back outside and all of a sudden there were 4 jets flying in from 4 directions, directly at the light.  As they approached, the light became brilliantly bright, then shot straight up in the sky and disappeared. The jets circled for a couple of minutes, then left. About one minute later, the light came slowly back down and continued its slow progress around the countryside. Every time it made an abrupt turn, it became brighter, then after it turned, it dimmed to \"normal\" again.   BTW, there was no moon that night so it was pitch black outside and all the stars were clearly visible, and if anyone claims it was Venus, well, it doesn't move - at least not very fast! No helicopter whump, whump, whump. And besides, helicopters - even today - can't do what that light did. And whatever it was, it out flew 4 jets. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/1/1969 23:00  (Entered as : 06/01/1969 23:00) Reported: 3/13/2006 9:09:35 PM 21:09 Posted: 5/15/2006 Location: Orangevale, CA Shape: Unknown Duration:30 to 45 minutes", "date_time": "6/1/69 23:00", "report_link": "http://www.nuforc.org/webreports/049/S49619.html", "city": "Orangevale", "state": "CA", "shape": "Unknown", "duration": "30 to 45 minutes", "summary": "UFO over Orangevale, CA in May/June 1969", "posted": "5/15/06"}
{"text": "A  FLYING OBJECT BURNED TOP OF TREES IN ROCKY MOUNT, NC. 1969 I WAS ALMOST 10 YEARS OLD. I WAS STANDING IN FRONT OF GRANDMOTHER'S HOUSE ON BERVERLY ROAD. MY BROTHER AND TWO BOYS ACROSS STREET WERE PLAYING. I SAW WHAT LOOKED LIKE A POSSIBLE FIRE ON OTHER STREET.  THERE WAS A BRIGHT RED GLOW IN SKY. I CALLED MY BROTHER AND FRIENDS OVER. I SAID LOOK A FIRE. THEY CAME OVER AND REMARKED HOW CLOSE THE FIRE SEEMED TO BE. I SAID LOOKS LIKE IT IS GETTING CLOSER. AS I WATCHED,I STARTED TO SEE SOMETHING IN SKY MOVING. IT WAS A HUGE RED BALL JUST ABOVE THE TREES. AS IT GOT CLOSER I COULD SEE THAT THE BOTTOM WAS TOUCHING THE TOP OF THE TALLEST PINE TREES. IT EVEN KNOCKED SOME OF THE UPPER LIMBS OUT OF MY GRANDMOTHER'S TREES. BEFORE THIS EVENING ALL THE TREES WERE BRIGHT GREEN EVEN IN THE TOPS ON OUR BLOCK. THE HOMES ON AVERAGE, WERE 1500 SQ.FT. RANCH STYLE HOMES.  FRONT YARD WAS ABOUT 60-70 FT. WIDE AND 50FT. FROM HOUSE TO STREET. OTHER YARDS AND HOMES WERE OF EQUAL SIZE. THE OBJECT HAD AN OVER ALL WIDTH OF 3 TO 4 HOMES AND YARDS. I SAID OUT LOUD, THIS IS SOMETHING ELSE. AND LOOKED AT MY BROTHER. I SAW HIM AND FRIENDS LYING ON GROUND OUT COLD. I COULD FEEL EXTREME HEAT COMING FROM OBJECT. IT MOVED ACROSS STREET OVER OUR HOUSE. I LIVED WITH GRAND MOTHER. AND ON OVER HOMES BEHIND OURS. I WOULD SAY IT MOVED AT ABOUT 1 TO 2 MILES AN HOUR. AFTER IT WAS GONE, I WOKE THE OTHER BOYS UP. AND ASKED THEM WHY THEY WENT TO SLEEP. THEY SAID THEY COULD NOT REMEMBER ANYTHING EXCEPT RED GLOW IN SKY. I TOLD THEM WHAT HAPPENED, THEY JUST LAUGHED. I THOUHT EVERYONE ELSE WOULD TOO, SO I DID NOT TELL ANY ONE ELSE. MY GRANDMOTHER DID ASK WHY WE HAD SUNBURNS. BECAUSE, SHE DID NOT NOTICE THEM AT DINNER. WE DID NOT ANSWER HER. THE NEXT DAY I SAW THE TOPS OF ALL THE TREES THAT WERE NEAR THE OBJECT. WERE VERY BROWN AND SCORCHED LOOKING. I EVEN FOUND LIMBS & PINE CONES IN YARD. THAT HAD BEEN BURNED BLACK AND CHARRED LOOKING. EVER SINCE THEN I HAVE BEEN VERY RESTLESS, AND HAVE HAD TROUBLE SLEEPING. I KNOW I AM NOT STUPID, BECAUSE I HAVE SERVED WITH THE CIA AND NAVAL INTELLIGENCE SINCE THEN. I ALSO SCORED 125 ON MY MILITARY ENTRANCE EXAM (ASVAB TEST). INCIDENT OCCURED 2145 07/27/69. ROCKY MOUNT,NC.. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/27/1969 21:45  (Entered as : 07/27/69 21:45) Reported: 5/2/2006 10:23:58 PM 22:23 Posted: 5/15/2006 Location: Rocky Mount, NC Shape: Sphere Duration:15 MINUTES", "date_time": "7/27/69 21:45", "report_link": "http://www.nuforc.org/webreports/050/S50399.html", "city": "Rocky Mount", "state": "NC", "shape": "Sphere", "duration": "15 MINUTES", "summary": "A  FLYING OBJECT BURNED TOP OF TREES IN ROCKY MOUNT, NC. 1969", "posted": "5/15/06"}
{"text": "DISC SHAPED OBJECT WITH BRIGHT WHITE LITES PULSING AROUND THE BOTTOM AND FEELING OF TRANCE STATE WHEN I WAS ABOUT 10 YEARS OLD, I WAS IN FRONT OF A FRIEND'S HOUSE LOOKING FOR SOMEBODDY TO PLAY WITH. I FEEL I MAY HAVE LOST TIME BECAUSE OF HOW I FELT WHEN I FINALLY RAN HOME. I FELT DISORIENTED AND DO NOT REMEMBER HOW LONG I WAS LOOKING UP AT THIS DISC I SAW.  IT WAS SILVER/METAL IN COLOR AND SAUCER SHAPED ON THE BOTTOM.  IT HAD OBLONG SHAPED LIGHTS IN A CIRCLE FORMATION ON THE BOTTOM OF IT TOO. THE LIGHTS LIT ONE AT A TIME REAL FAST IN A CONTINIOUS CIRCULAR MOTION.  I REMEMBER WATCHING THE LIGHT GO AROUND IT SO FAST, AND WAS JUST STARING AT IT AND WAS IN AWE AT HOW IT WAS MOVING SO QUICK, LIKE A FAST \"PULSING\" MOTION. THE LIGHTS WERE THE MOST AMAZING COLOR OF WHITE AS IT WENT AROUND, BUT THE ONES THAT WERE NOT LIT WERE MORE OF A DULL WHITE COLOR.  I SENSE THAT IT MADE NOISE, BUT I DON'T REMEMBER \"HEARING\" A PARTICULAR NOISE.  AT THE TIME I WAS STARING AT IT, I WAS NOT AFRAID.  BUT WHEN I \"SNAPPED\" OUT OF IT, I SUDDENLY FELT AFRAID AND LOOKED AROUND ME AND IMMEDIATELY LOOKED BACK UP AND IT WAS GONE. IT WAS THEN THAT MY FRIGHT TURNED TO MORE ON THE TERRIFIED SIDE, AND I TURNED AROUND AND RAN HOME. I ALSO SEEMED TO BE ABLE TO \"FEEL\" THAT IT WAS THERE.  TO THIS DAY I FEEL SOMETHING ELSE MAY HAVE HAPPENED, BUT WHEN I REALLY CONCENTRATE AND TRY TO REMEMBER SOMETHING ELSE ABOUT THAT DAY, I START FEELING TO ANXIOUS.  I FEEL LIKE I KNOW SOMETHING ELSE, BUT CANNOT QUITE PUT MY FINGER ON IT, SO TO SPEAK.  I AM STILL LEFT WITH AN UNSETTELING FEELING. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/1/1970 19:00  (Entered as : 07/01/1970 19:00) Reported: 3/14/2006 3:27:11 AM 03:27 Posted: 5/15/2006 Location: Warren, MI Shape: Disk Duration:don't know", "date_time": "7/1/70 19:00", "report_link": "http://www.nuforc.org/webreports/049/S49627.html", "city": "Warren", "state": "MI", "shape": "Disk", "duration": "don't know", "summary": "DISC SHAPED OBJECT WITH BRIGHT WHITE LITES PULSING AROUND THE BOTTOM AND FEELING OF TRANCE STATE", "posted": "5/15/06"}
{"text": "UFO hovering over potato field behind my girlfriends house Oject was hovering over a potato field behind my girlfriends house. It was late in the day around 7pm. My brother was walking home from a friend's house and I was in my bedroom window calling him home. At that time we both saw a gigantic ufo just hovering very low looking like it may want to land. I called over to my friends house to tell them to look out into their back yard and at that moment it disappeared in a flash. It was silver in color with lights that went around it. It did'nt make a sound. It was huge. My brother witnessed it as well as he was just about in front of our home at this time.", "stats": "Occurred : 7/15/1970 19:00  (Entered as : 07/15/70 19:00) Reported: 4/2/2006 6:32:28 PM 18:32 Posted: 5/15/2006 Location: South Windsor, CT Shape: Oval Duration:5 min.", "date_time": "7/15/70 19:00", "report_link": "http://www.nuforc.org/webreports/049/S49928.html", "city": "South Windsor", "state": "CT", "shape": "Oval", "duration": "5 min.", "summary": "UFO hovering over potato field behind my girlfriends house", "posted": "5/15/06"}
{"text": "ball of fire in summer sky fireball was 500 feet elevation traveling north to south and had spark shooting from it. lit up our entire neighborhood like it was day. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/22/1970 20:00  (Entered as : 07/22/70 20:00) Reported: 3/24/2006 4:43:06 PM 16:43 Posted: 5/15/2006 Location: Stockton, CA Shape: Fireball Duration:5 seconds", "date_time": "7/22/70 20:00", "report_link": "http://www.nuforc.org/webreports/049/S49802.html", "city": "Stockton", "state": "CA", "shape": "Fireball", "duration": "5 seconds", "summary": "ball of fire in summer sky", "posted": "5/15/06"}
{"text": "The disc was silver no lights or seems but we only saw the bottom not the top or sides. when i was about ten years old i was playing in the back yard at my brothers house. and yes my two brothers and my sister were much older than me. anyway, me,  my nephew and my two neices heard this humming sound and did'nt know where it was coming from then we saw the edge of this disc shaped craft come right over the top of the trees until it was right over the top of us. It was so big it blocked the sunlight for a whole block, we all started screaming. the adults were inside playing cards, my brother-inlaw heard us screeming and ran to the door to see what was going on. when he looked up to where we were pointing, his eyes got real big, then he ran down the hall to get the shotgun i could tell he was terrified. When he put his hands on the gun, the craft lifted and slowly moved off. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))", "stats": "Occurred : 6/1/1971 17:00  (Entered as : 1971 17:00) Reported: 5/9/2006 5:23:48 PM 17:23 Posted: 5/15/2006 Location: Forrest City, AR Shape: Disk Duration:2 min.", "date_time": "6/1/71 17:00", "report_link": "http://www.nuforc.org/webreports/050/S50493.html", "city": "Forrest City", "state": "AR", "shape": "Disk", "duration": "2 min.", "summary": "The disc was silver no lights or seems but we only saw the bottom not the top or sides.", "posted": "5/15/06"}
{"text": "Silent trapezoid (triangle with its head cut off). Oklahoma, 1971. One fairly clear evening (~8:45) at dusk, in the summer of 1971, my brother (11) and I (male, 13) visited our 3 friends [Female(14), female (12) and male (8)], who had relocated from the Houston area the previous summer. We were outside Broken Bow, OK. We were west (~5 miles) and somewhat south of the city and in a very rural area. We were walking north to see their church at night -- an exciting/scary thing to do! The birds had stopped singing and the crickets had not yet started, so it was very quite. I noticed that there were three lights toward Broken bow that were not blinking. I asked if they had any towers out there and they said they didn't know. And something was mentioned about their living in that particular location (on rural acreage in a mobile home) only since December (~7 months). So we just kept walking toward the church. About a minute or so later, we looked up to see a very large opaque trapezoid (triangle with its head cut off) with three lights. It was moving very slowly toward the sun that had already set. The narrow end of the trapezoid led and the wide end followed. It blocked out the atmospheric haze that was still aglow because the sun was not quite completely gone. It continued westward until it was obscured by the wooded area to the west of us. The lights were as such, two in the front on each corner and one in the north corner only. I do not remember their colors. The amazing thing is that it made no noise. There is no way to be certain of its size/height, although if I had to guess, since I thought the lights were towers, then it must not have been too high, assuming it maintained its height. If it was that height, I'd guess it to be about 1/3 the size of a football field.  I was elated to hear about the one in Phoenix in the 1990's. Although it was chevron-shaped, and had more lights, like ours, it was hovering, expansive and silent. I assume the aliens have changed their designs over the years; either out of boredom or out of necessity, scientific or economic - gotta keep up with the Joneses-Snergabloids. LOL. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/14/1971 20:45  (Entered as : 06/14/71 20:45) Reported: 4/29/2006 6:55:37 AM 06:55 Posted: 5/15/2006 Location: Broken Bow, OK Shape: Triangle Duration:3 minutes", "date_time": "6/14/71 20:45", "report_link": "http://www.nuforc.org/webreports/050/S50339.html", "city": "Broken Bow", "state": "OK", "shape": "Triangle", "duration": "3 minutes", "summary": "Silent trapezoid (triangle with its head cut off). Oklahoma, 1971.", "posted": "5/15/06"}
{"text": "various coloured fireball emitting sparks and totally silent My friend and I were being chased by his brother in my backyard and we simultaneously saw an oval shaped fireball streaking through the sky very low. It was emitting gold, silver, green, and orange sparks and was silent and moved very fast. We thought it hit the top of an apartment building nearby so we ran towards it. My other friend who lived across the street was coming to call on me and also noticed it. When we arrived at the apartment building, numerous people were walking about looking around and talking about it. There was no physical evidence. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/15/1971 11:00  (Entered as : 07/15/1971 11:00) Reported: 4/16/2006 7:31:57 PM 19:31 Posted: 5/15/2006 Location: Toronto (Canada), ON Shape: Fireball Duration:3 seconds", "date_time": "7/15/71 11:00", "report_link": "http://www.nuforc.org/webreports/050/S50142.html", "city": "Toronto (Canada)", "state": "ON", "shape": "Fireball", "duration": "3 seconds", "summary": "various coloured fireball emitting sparks and totally silent", "posted": "5/15/06"}
{"text": "I looked up to identify the source of the sound and saw an object with multicolored lights that were flickering in a sort of pattern. On a quiet warm summer night I pulled up to my parent's house where I still lived while finishing my second college year. Across the street there was a high school football field with an old wood grandstand on the opposite side that faces the field and across to our house. Getting out of the car I heard an intermittent buzzing sound which seemed to come from the field. I thought it might be new sprinklers but the sound was odd so my curiosity was aroused. As I attempted to focus on the sound it shifted from the left to the center of the field and it also echoed off the grandstand. Audibly I realized it was off the ground. I looked up attempting to identify the source of the sound and I saw an object with multicolored lights that were flickering in a sort of rotating pattern.It appeared to have followed my car and was maneuvering in a tightening circle thus shortening its trajectory directly at me, and it was descending. I was awestruck long enough to observe subtle lights of green, red, blue and white on the bottom of the object. I have piloted a plane, boated, and I understand navigation lights well and these were not regular navigation lights. My hair stood on end as I was aware that I was likely witnessing a greatly advanced mechanical object. Suddenly, in sheer animal panic, I ran to the back porch of the house. I was really shaking as I fumbled with the key to unlock the door and the buzzing got louder indicating that it was getting closer yet. I rushed in and yelled at my parents who had been in bed a little while. They came out to the kitchen by the porch but the sound dissipated and they didn't hear it. Reflecting back, the object seemed rather small, perhaps smaller than my car. I am a sane and logical person and I truly believe what I experienced was not of this world, or at least anything mankind has created. I have told very few people this and this is the first time I have reported it in this way. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/25/1971 23:40  (Entered as : 7/25/1971 23:40) Reported: 4/3/2006 10:04:59 PM 22:04 Posted: 5/15/2006 Location: Puyallup, WA Shape: Circle Duration:2 minutes", "date_time": "7/25/71 23:40", "report_link": "http://www.nuforc.org/webreports/049/S49950.html", "city": "Puyallup", "state": "WA", "shape": "Circle", "duration": "2 minutes", "summary": "I looked up to identify the source of the sound and saw an object with multicolored lights that were flickering in a sort of pattern.", "posted": "5/15/06"}
{"text": "Large, black,  \"boomerang\" shaped object gliding silently overhead. My financee and 2 friends were at a local drive-in theater. We were all college students at the time. I happened to look up outside the car window and noticed a huge black \"boomerang\" shaped object slowly gliding across the sky. It was directly overhead. It had several lights spaced out along its leading edge. There was no sound from the object at all. I would estimate that it's height above ground was about 1000 feet. I excitedly pointed out this observance to my friends in the car and they also saw it. It was headed in a general direction from west to east. The drive-in was located about 7-8 miles east of the Albany International Airport, about 2 miles south of the U.S. Army's Watervliet Arsenal, and 1 mile north of Albany.  This incident happened 35 years ago so the exact date is not known. I know however that it was in the fall of 1971. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 10/12/1971 22:00  (Entered as : 10/12/71 22:00) Reported: 3/26/2006 9:11:32 PM 21:11 Posted: 5/15/2006 Location: Menands (Albany), NY Shape: Chevron Duration:3 minutes", "date_time": "10/12/71 22:00", "report_link": "http://www.nuforc.org/webreports/049/S49834.html", "city": "Menands (Albany)", "state": "NY", "shape": "Chevron", "duration": "3 minutes", "summary": "Large, black,  \"boomerang\" shaped object gliding silently overhead.", "posted": "5/15/06"}
{"text": "big blue fireball very low I was walking with my mother (I was 12 y.o) to church on Christmas morning.  It was overcast when I suddenly remembered that the news said that a comet would be visible on Christmas day and that it could be the same one seen by the wise men.   I looked up and I saw a ball of blue light come out of the clouds and back into the clouds.  I saw the ball that was covered with blue flames, really beautiful like an aquamarine gemstone.  I could see the flames licking the surface of the object.  I told my mom but of course it was gone.  I felt very fortunate to have seen the comet.  I wasn't until a decade or more later that I thought, wait a minute, a comet isn't low enough to be in the clouds and it was traveling slowly.  I could have been my active imagination maybe.  If so then the mind is an incredible thing.  I saw it as clearly as any object is see before me now.", "stats": "Occurred : 12/25/1971 08:00  (Entered as : 12/25/71 8:00) Reported: 4/9/2006 3:05:51 AM 03:05 Posted: 5/15/2006 Location: Oxnard, CA Shape: Sphere Duration:2 seconds", "date_time": "12/25/71 08:00", "report_link": "http://www.nuforc.org/webreports/050/S50053.html", "city": "Oxnard", "state": "CA", "shape": "Sphere", "duration": "2 seconds", "summary": "big blue fireball very low", "posted": "5/15/06"}
{"text": "ODD SOUND THE YEAR 1972   I WAS JUST GOING TO BED AT 3 IN THE MORNING AFTER WATCHING BOXING ON TV.  IN MY HOUSE IN ESSEX UK,WHEN I GOT TO MY BEDROOM THERE WAS A HUMMING NOISE COMMING FROM WHAT SEEMED TO BE ABOVE THE ROOF OF THE HOUSE. THIS WAS A VERY DEEP HUM.AS   AT THAT TIME I HELD A PILOTS PPL.   I NO IT WAS NO FLYING MACHINE THAT WAS MADE BY MAN?    THE SOUND MOVE SLOW OVER THE ROOF TOPS AND WHEN OF INTO THE NIGHT SKY.  BY YHE TIME I HAD GOT THE WINDOW OPEN IT WAS GONE. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))", "stats": "Occurred : 5/7/1972 00:00  (Entered as : 5/7/72 3) Reported: 5/8/2006 7:22:22 PM 19:22 Posted: 5/15/2006 Location: Essex (UK/England),  Shape: Unknown Duration:3 mins", "date_time": "5/7/72 00:00", "report_link": "http://www.nuforc.org/webreports/050/S50480.html", "city": "Essex (UK/England)", "state": null, "shape": "Unknown", "duration": "3 mins", "summary": "ODD SOUND", "posted": "5/15/06"}
{"text": "huge orange circular fireball in Quebec I've seen these fireballs twice in my life. I lived in the countryside back then in Les Escoumins, a small village in the province of Quebec in Canada.  The first  time i was about 5 years old . I am now 38 years old. The second time it was about 2 or 3 years after that .  The first time we were several people who saw it. We called neighbours and they saw it as well. It was a huge round orange fireball crossing the horizon line.  The sun was on the west side and that fireball was going towards Maine ( so it was going from north to south when looking into the west direction).  We all saw it for a few minutes untill it desapeared ( some peole said it plunged into the st Laurent river so if it did, it changed it's directory to go down). Some other people said that an army aircraft tried to chase it but i haven't seen any aircraft at that time.  It must have been at least 5 times bigger than the sun.  It was just amazing an no one ever knew what it was. It left no trace of smoke on it's path.  The second time, i was back home after going to see a car accident that happened up the street from where i lived ( there must be a report somewhere at the police station about that accident if i ever want to know the exact date of ny sighting).  At that time , it was peach dark and there was no light post around.  I saw the exact same fireball on my way back home.  This time i was in the north direction and the firewall was heading West.  Same fireball, same speed, same everything but it was much furter.  I've seen shooting stars many many times before and after the events and i can tell that it was not one. The movement was constant. Both times, they were not going in an angle but on a straight horizontal line.  No noise, no crashing ( that i saw) , no reports in the medias.  What strikes me the most is when many years later i saw the movie about the Allagash Abductions.  The fireball looked a lot like the object in the movie. Was it the same object? I don't know. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/1/1972 18:00  (Entered as : 19720701 18:00) Reported: 3/19/2006 11:37:00 PM 23:37 Posted: 5/15/2006 Location: Les Escoumins (Canada), QC Shape: Fireball Duration:a few minutes", "date_time": "7/1/72 18:00", "report_link": "http://www.nuforc.org/webreports/049/S49731.html", "city": "Les Escoumins (Canada)", "state": "QC", "shape": "Fireball", "duration": "a few minutes", "summary": "huge orange circular fireball in Quebec", "posted": "5/15/06"}
{"text": "Strange Lights Indeed  Upon returning home on a beautiful spring evening, in the approximate year of 1973, rounding the corner to my country abode I saw 3 lights above the forest. It was evident that these lights were round in shape. The time was approximately 9:30pm - it was dark by now. The colour emanating from them was like bright headlights, white with a slight yellow hue, yet they were above the trees. I am a mother of 6 children and of sound mind and character. I don’t make stuff up. I live near a very large, deep and pristine lake in NE Alberta, Canada.  My home is nestled in a forested area adjacent to one of the many bays of this lake, named Cold Lake. To the west of my home, approximately 4 miles, is the largest jet fighter Air Force Base in Canada. I am very used to and familiar with seeing and hearing these jet aircraft on a regular basis. What I witnessed this night was very different. After a few minutes of gazing upon this anomaly, one of the lights sped away in a westward direction. Its take-off or acceleration was like nothing I had ever seen in a conventional aircraft, jet, helicopter, prop-plane, whatever.  One could compare its take-off to the release of an arrow from a bow.  Also, there was absolutely no sound. I would estimate their distance away from me at ½ mile or less. This left 2 lights still in place above the trees. Given the estimate of ½ mile distance away, the actual size of the lights would likely be somewhat larger than virtual headlights. No structure, definition or appendage to the lights was visibly evident; it was a dark night. Upon my arrival home, one block from my initial visual, my son, very excited, asked if I had noticed the lights above the trees over there? I responded with, \"“yes\", of course! We discussed the matter briefly, including the one that got away and decided to investigate further. The lights were hovering over a marshy area. The water was lit up due to the proximity of these lights emitting upon it. The light would pulsate seemingly on a timed or regular basis. It is important to note that there are no roads where these lights appeared; the only road is the one to my house. I state this so that no one will have notions that they were motor vehicles; how could they be?  At the time of this sighting we had 5 dogs. Don’t ask why, we just did. As the light decreased from full intensity to zero light or pulsated from normal to no light, the dog’s hair would stand straight up on their backs and they would bark, acting erratic in nature. When the light returned to normal the dog’s behaviour did too. I said that my son and I were going to investigate further and so we did.  At approximately 10:00pm we decided to drive around to the top of a nearby knoll hoping to get a better view.  The lights were still visible but somehow appeared to have moved to a more distant location.  We watched them (the 2 remaining lights) for about 10 minutes and then decided to go home.  Upon attempting to start the car it was discovered that it was unable to turn over; it was \"dead,\" so-to-speak - very uncharacteristic of this vehicle because the battery was new and maintained regularly.  We supposed that somehow these lights had an effect on the operation of our car.  So, we had to walk home. As the evening progressed we would periodically look outside to see if the lights were still present.  It was midnight when we finally went to bed and the lights continued in place. I must say that the whole experience gave me what I would define as a spooky or unnerving sense of emotion. We returned to our car the next morning; it started without incident. Strangely enough, I spoke to a neighbour about this event.  Earlier in the evening, at about 7pm, he was travelling to his home and witnessed a light or lights travel immediately over his car at a high rate of speed.  Perhaps these lights were related or of the same group. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 4/15/1973 21:30  (Entered as : 04/15/73 21:30) Reported: 4/6/2006 8:24:26 AM 08:24 Posted: 5/15/2006 Location: Cold Lake (Canada), AB Shape: Light Duration:3hrs", "date_time": "4/15/73 21:30", "report_link": "http://www.nuforc.org/webreports/049/S49989.html", "city": "Cold Lake (Canada)", "state": "AB", "shape": "Light", "duration": "3hrs", "summary": "Strange lights", "posted": "5/15/06"}
{"text": "triangles made of 9 lights--no object seen I submitted an account of this event two or three years ago. It apparently was not received, as it is not in the website database. Since that submission, my recollection of the event has improved and therefore changed somewhat.  This is a recollection of a sighting of unknown lights in an unusual pattern sometime in the early 1970's, perhaps 1973 or 1974. I have tried to remember details and circumstances as accurately as possible. I am no aviation expert but I have grown up around aircraft, living near Reid-Hillview Airport, well before it was purchased by Santa Clara County and became a FSS, and I was acquanted with the former owner, his daughter and her family, as well as others who worked there or had tiedowns or hangars, so I know more than a little bit about aviation. There are some explanations for those who are unfamiliar with aviation as well as to explain why I do not believe that the lights belonged to any ordinary aircraft.  In the early 1970's I was at home during a late spring or summer evening and looked up to see nine orange/amber lights arrayed in three equilateral triangles which were themselves arrayed as one large equilateral triangle. Each orange light was at the point, or vertex, of each small triangle which themselves were at the points of the larger triangle, nine lights in all.  The night was warm and the smog was thick enough that no stars could be seen. There was no moon. Typically, above the smog, I am told there is a strong Westerly wind in the evening and into the night.  The array maintained perfect equilateral triangles as it headed roughly north-northwest in a straight line, It appeared to move slowly, like a light airplane but seemed to be silent. I watched the lights closely for some time, from when it was almost overhead, as it passed overhead and then was lost in the smog and reflected city lights somewhere over the north part of the city, trying to see the outline of some object and watching the lights to see if any moved independently, as well as for any lateral drift. I never could see any object, just the lights, none of the lights moved relative to the others and no lateral drift was observed. I estimated it could be seen for at least fifteen minutes.  The array was unusual as no navigation lights were seen: No red, no green, no white, no strobe or flashing lights of any kind, just steady orange/amber lights, which I realised later had the same color as low-pressure sodium street lights.  I know what aircraft look like in the sky at night, as I lived next to a small civil airport at that time and lived directly under the southbound departure route for the city's major airport and I often watched aircraft go over, trying to guess what kind it was. Sometimes, because of the smog, all that can be seen are the navigation lights. I have never seen such lights on any aircraft before or since. It occurred to me that the aircraft might have been some of the new SR-12's recently made public but the lights never moved relative to each other, they never drifted from course and there were no navigation lights, as would be required near the airports under VFR rules.  There was no engine noise. At the time, jet engines were still quite loud and some DC9's, 727's and 737's, as well as DC8's from Mexico were still using turbojets instead of the quieter fans. Neither turbine nor piston engines were heard.  The array was viewed through smog which reflected the streetlights so there was only a view of the orange/amber lights. No solid object was seen, no reflections. The smog was thick enough that no stars could be seen, neither could any aircraft from either airport. But somehow those lights could be seen.  Because of the smog,  the exceptionally slow speed and the lack of any visible shape I could not determine the altitude or the size of the object or objects attached to the lights.  I asked around to see if anyone else had seen the aray of lights; no one had. The FAA and the local newspaper both pointedly expressed their lack of interest in the event. It remained forgotten until I saw another very unusual sky object while in Monterey. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD))", "stats": "Occurred : 6/15/1973 22:30  (Entered as : 06/15/1973 22:30) Reported: 5/14/2006 9:04:58 PM 21:04 Posted: 5/15/2006 Location: San Jose, CA Shape: Triangle Duration:15min+", "date_time": "6/15/73 22:30", "report_link": "http://www.nuforc.org/webreports/050/S50566.html", "city": "San Jose", "state": "CA", "shape": "Triangle", "duration": "15min+", "summary": "triangles made of 9 lights--no object seen", "posted": "5/15/06"}
{"text": "Extremely bright light in sky near power plant This sighting occured in rural Alabama on the Chattahoochee River, approximate 20 miles north of Columbus, GA.   From my vantage point at Bartlett's Ferry Dam, a high point were one has 10-15 mile visibility, extremely bright lights were seen hovering in the sky in the approximate vacinity of Ga. Power Company's Goat Rock Hydro-electric plant in Lee Co. Alabama/Harris Co. GA.  I observed this light hovering for about an hour before I returned home.  A close relative, an officer for Ga. Power, told me that there were no contruction projects and no bright lights of this type in the area.  The lights were too high in the sky to have been from a building anyway, and they were too large and intense to have been from a regular aircraft. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))", "stats": "Occurred : 7/1/1973 22:00  (Entered as : 07/01/73 22:00) Reported: 3/20/2006 11:11:24 PM 23:11 Posted: 5/15/2006 Location: Alabama (rural), AL Shape: Unknown Duration:1 hour", "date_time": "7/1/73 22:00", "report_link": "http://www.nuforc.org/webreports/049/S49750.html", "city": "Alabama (rural)", "state": "AL", "shape": "Unknown", "duration": "1 hour", "summary": "Extremely bright light in sky near power plant", "posted": "5/15/06"}
{"text": "Saucer craft landed near us. On this lovely fall day 2 friends and I were searching for old bottles in a remote pasture where a homestead once stood.  We were there several hours.  Around three o'clock a HUGE silver saucer craft glided silently down from the sky and followed the contours of the hills landing on the other side of the hill from us, probably 1/2 to 1 mile away.  We could not see the craft from where we were standing.  At first we were scared and then about 20 minutes later, when nothing happened, we decided to \"live and let live\" and went on searching for bottles.  About an hour and half later we heard three electronic beeps from the other side of the hill.  It was then we decided to leave.  The next day a friend of ours told us he had seen the craft come down near our property from his place on the other side of town (about 10 miles away) and wondered if we had seen it.  As far as I know this siting was never reported. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 9/22/1973 15:00  (Entered as : 9/22/73 15:00) Reported: 4/23/2006 10:13:22 AM 10:13 Posted: 5/15/2006 Location: Philip, SD Shape: Disk Duration:one hour", "date_time": "9/22/73 15:00", "report_link": "http://www.nuforc.org/webreports/050/S50245.html", "city": "Philip", "state": "SD", "shape": "Disk", "duration": "one hour", "summary": "Saucer craft landed near us.", "posted": "5/15/06"}
{"text": "Group of about 20 sees UFO on clear day for about 5 minutes in 1973 in SW TENN. While driving one afternoon with two friends ,going west on US72 HWY, we saw a line of cars parked on the roadside and all the drivers standing and looking at an object about 1mile away hovering over a stand of trees.  We stopped to watch also and saw a disk shaped object moving very slowly at a height of roughly 500ft. about 1 mile away.  It had flashing white lights, was silent and after moving back and forth over the trees and feild shot off at a vertical angle at an  unbelieveable speed.  Everyone was dumbfounded and quitely got back into their cars and left. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 10/15/1973 16:00  (Entered as : 10/15/73 16:00) Reported: 3/22/2006 2:28:56 PM 14:28 Posted: 5/15/2006 Location: Collierville, TN Shape: Disk Duration:5 minutes", "date_time": "10/15/73 16:00", "report_link": "http://www.nuforc.org/webreports/049/S49776.html", "city": "Collierville", "state": "TN", "shape": "Disk", "duration": "5 minutes", "summary": "Group of about 20 sees UFO on clear day for about 5 minutes in 1973 in SW TENN.", "posted": "5/15/06"}
{"text": "3 object circle, large outer side moveing around, white lights lasted for 3-4minutes My girl friend and I were on our way home after visting another friend and we were both on our bikes.  As both of us we riding our bikes, I looked up to the south/East about the large trees and right above them were the three objects hovering and not moving.   I screamed, fell off my bike, my friend looked at me first and then looked up to see the exact same object not moving, but the outer part was moving around the main center part and the lights were white.  She grabbed me to get up, I got back on my bike, screaming all the way home.   When we got back to my house my mom came out to see what was going on.  I could not talk either could my friend.  The object made a humming sound when the outer ring was moving round the center.   The ojects followed us all the way down as soon as we both got on our bikes and riding home.  As soon as we got home, and my mom came out all three we gone.  I have talked this this friend over the years about the experience but either one of us have told others, but my mom.   I am happy to have an outlet to tell this story that happened because I have been holding it in for so many years. ((NUFORC Note:  Witness indicates that date in April 1974 is approximate.  PD))", "stats": "Occurred : 4/15/1974 22:00  (Entered as : 04/00/1974 22:00) Reported: 4/13/2006 9:01:23 PM 21:01 Posted: 5/15/2006 Location: Ventura, CA Shape: Circle Duration:3-4minutes", "date_time": "4/15/74 22:00", "report_link": "http://www.nuforc.org/webreports/050/S50117.html", "city": "Ventura", "state": "CA", "shape": "Circle", "duration": "3-4minutes", "summary": "3 object circle, large outer side moveing around, white lights lasted for 3-4minutes", "posted": "5/15/06"}
{"text": "Close Encounters of the real kind (space craft) flied right over my head within a 100 yards traveling less than 5 miles an hour I wrote my descrition earlier yesterday but forgot to input my Witness information. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  One of several reports from the same source, who has telephoned our Center on several occasions.  PD))", "stats": "Occurred : 8/10/1974 01:00  (Entered as : 08/10/74 1:00) Reported: 4/27/2006 11:22:31 PM 23:22 Posted: 5/15/2006 Location: New Rochelle, NY Shape: Oval Duration:1 minute", "date_time": "8/10/74 01:00", "report_link": "http://www.nuforc.org/webreports/050/S50317.html", "city": "New Rochelle", "state": "NY", "shape": "Oval", "duration": "1 minute", "summary": "Close Encounters of the real kind (space craft) flied right over my head within a 100 yards traveling less than 5 miles an hour", "posted": "5/15/06"}
{"text": "Close encounters of the real kind (space craft) for at least one minute about 100 yards right over my head I was 11 years old on this one particular bright day in the afternoon in the summer of 1974 when I was standing outside my two story duplex house when a cast of dark shadow cover me and the whole house.   When I looked up there was this huge aircraft flying right over my house traveling less than 5 miles an hour.   I fell to the ground frightened by the size and how low it was traveling.  At this particular age I was not sure what to think this really was.  This aircraft made no noise whats so ever.  It just came up behind me out of no where.   I would say that this aircraft with its technology probably took pictures of me hundred times before I noticed its existence.   The other side of my block is about 100 ft. across approximately which at the speed of this aircraft was traveling, they had observed my presence for at least 30 seconds or more before I identified them.  There are houses on the other side of my block.   When I fell to the ground I was looking at this aircraft slowly flying right over my two story house with cavities and lights underneath its craft and dark greyish in color.  Iam not exactly sure the total shape of this aircraft because it was so low hovering right over my head.   When it passed my house I could not believe what just happen.   I ran up my house and told my parents but there could not understand or comprehend my story. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))", "stats": "Occurred : 8/10/1974 13:00  (Entered as : 08/10/74 13:00) Reported: 4/27/2006 9:50:59 AM 09:50 Posted: 5/15/2006 Location: New Rochelle, NY Shape: Oval Duration:1 minute", "date_time": "8/10/74 13:00", "report_link": "http://www.nuforc.org/webreports/050/S50308.html", "city": "New Rochelle", "state": "NY", "shape": "Oval", "duration": "1 minute", "summary": "Close encounters of the real kind (space craft) for at least one minute about 100 yards right over my head", "posted": "5/15/06"}
{"text": "Columbia, South Carolina 1974 Sighting. I spent 12 years in the U.S. Army.  From 1973 to 1976 as an M.P. (Military Policeman) working undercover for the D.S.T. (Drug Suppression Team)  C.I.D. (Criminal Investigation Division) in Germany.  Basically, I traveled throughout Germany, wearing civilian clothes and pretending I was a former soldier that now resided in Germany dealing narcotics.  My codenames were Porkchops or Frisco, depending on what part of Germany I was at.  I went after what was known as the \"Khaki Mafia\" that originated in Vietnam.  The perpetrators recognized me, because I was known to wear a black trenchcoat, sunglasses, dark clothes and at the time I was sporting a beard and mustache.    But, before this excitement took place, I was in Ft. Jackson, South Carolina, in 1974 on a training exercise.  One night, two other soldiers and I were in Columbia, South Carolina, checking out the sights and we looked in the sky and saw 6 glowing blue discs in formation.   As we watched the UFOs dispersed in erratically zig zagging movements and disappeared quickly.  The first thing that came out of one soldier’s mouth was ‘geese?’  We looked at him and said ‘no way!’.   That was my first time experiencing a UFO encounter and it stayed with me for a long, long time.", "stats": "Occurred : 9/13/1974 21:00  (Entered as : 09/13/1974 21:00) Reported: 4/28/2006 8:39:04 AM 08:39 Posted: 5/15/2006 Location: Columbia, SC Shape: Disk Duration:5 minutes", "date_time": "9/13/74 21:00", "report_link": "http://www.nuforc.org/webreports/050/S50321.html", "city": "Columbia", "state": "SC", "shape": "Disk", "duration": "5 minutes", "summary": "Columbia, South Carolina 1974 Sighting.", "posted": "5/15/06"}
{"text": "I saw what I thought was a small odd looking plane but realized as it got closer it was no plane. The approximate date of this sighting was April 1975 and lasted for about 17 minutes. I was 13 years old and it occurred while I was watching for our school bus to come. The time was 07:40 and I saw what I thought was a small odd looking plane flying across the large open field southwest of our home. It was first seen at about 2500 Yards distant and only about 600 feet in height but continued to get closer, as the distance decreased I quickly realized this was not any aircraft of our technology. It was a crystal clear morning with no clouds and the sun was low in the east as it hit this object it looked like polished aluminum or stainless steel, it was not real large my best guess as to its size would be about 45-55 feet round but slightly cone shaped it had lights around bottom edge and they were rotating what looked to be in the opposite direction of the crafts rotation.   It came to within 120 yards of our home and then just stopped and hovered over the roof of our next door neighbors home and stayed in that spot for about 7 minutes and that’s when  I called my mom and sister to also watch this object and we all observed it until it decided to leave.  It went straight vertical and went out of sight with no sound of any kind. I look back on this event and to this day can’t understand why not one of us had taken any photos of this thing, we all had cameras but neither my sister, mother nor I thought to grab one and get pictures.  As close as this craft was it should have photographed extremely well.  I often think back and wonder if this thing had us hypnotized in some fashion. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 4/18/1975 07:40  (Entered as : 04/18/75 07:40) Reported: 5/6/2006 11:15:08 AM 11:15 Posted: 5/15/2006 Location: Waterford, PA Shape: Disk Duration:17 minutes", "date_time": "4/18/75 07:40", "report_link": "http://www.nuforc.org/webreports/050/S50441.html", "city": "Waterford", "state": "PA", "shape": "Disk", "duration": "17 minutes", "summary": "I saw what I thought was a small odd looking plane but realized as it got closer it was no plane.", "posted": "5/15/06"}
{"text": "LIGHTS OVER HAVERY GAP I WAS 8 YEARS OLD LIVING WITH MY FATHER AND COUSINS IN RIFLE, CO.  IT WAS A CLEAN WARM NIGHT GETTING READY FOR BED MY COUSIN AND I WENT UP STAIRS TO GO TO BED.   AFTER I LAYED DOWN, I HEARD A LOW HUMMING NOISE AND SAW A LIGHT OVER A LAKE ABOUT 6 MILES AWAY,  I JUST THOUGHT THAT IT WAS A HELICOPTER RETRIEVING WATER FOR A FIRE,  SO I LAYED DOWN AND WENT TO SLEEP.   WELL I GUESS THEY HEARD OR SAW ME.  I WOKE UP LATER UNKNOWN THE TIME AND I WAS SITTING UP LOOKING OUT THE WINDOW WITH THE OBJECT RIGHT OVER MY WINDOW I WAS ABOUT 12 FEET AWAY FROM IT IT WAS RIGHT ABOVE MY WINDOW AND TO THIS DAY I STILL REMEBER THIS THING.   I HAVE NEVER TOLD ANYONE ABOUT THIS.  BUT AT THE SAME TIME I FOUND OUT THAT A LOT OF CATTLE WERE BEING KILLED IN THE FIELDS. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/15/1975 10:00  (Entered as : 6/15/1975 10:00) Reported: 4/3/2006 12:43:15 PM 12:43 Posted: 5/15/2006 Location: Rifle, CO Shape: Disk Duration:", "date_time": "6/15/75 10:00", "report_link": "http://www.nuforc.org/webreports/049/S49937.html", "city": "Rifle", "state": "CO", "shape": "Disk", "duration": null, "summary": "LIGHTS OVER HAVERY GAP", "posted": "5/15/06"}
{"text": "White ball (about the size of a kick ball) hovers for a minute or two moving slow and then it was gone! My sister & I were in my aunts swimming pool 4th of July I think 1975 or 76 we never spoke about it at the time until about 2 years ago we were taking and the BALL came up. It was a white ball about the size of a kick ball maybe a little smaller. We both saw it.  It was moving very slow, just there like a minute or two. We both saw it and  as the ball was moving slowly towards us <It was gone> just like that GONE! Has anyone seen anything like what we remember? ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/4/1975 13:00  (Entered as : 07/04/75 13:00) Reported: 3/15/2006 7:45:31 PM 19:45 Posted: 5/15/2006 Location: Marley Park, MD Shape: Circle Duration:2 MINUTES", "date_time": "7/4/75 13:00", "report_link": "http://www.nuforc.org/webreports/049/S49660.html", "city": "Marley Park", "state": "MD", "shape": "Circle", "duration": "2 MINUTES", "summary": "White ball (about the size of a kick ball)hovers for a minute or two moving slow and then it was gone!", "posted": "5/15/06"}
{"text": "Very large black triangular craft observed on Okinawa Japan traveling from very slow to out of sight in seconds. I was in the United States Marine Corps, stationed at Camp Hansen on Okinawa, Japan.  The day was sunny with white cumulus clouds in the sky.   As I was walking along the base alone I noticed a shadow pass over me.  I looked up expecting to see a cloud.  Instead there was this large black triangular craft silently moving overhead very slowly.  It wasn't very high above the trees and I looked for identifiable markings but saw none.   I was familiar with most military aircraft but couldn't identify it so I thought maybe it was the SR 71 Blackbird which was still relatively secret.  My thought then was it couldn't be the Blackbird because it was as big as a B-52 and completely silent.   As I watched, it ascended straight up without pointing the nose of the aircraft up and disappeared in the clouds in an instant without any noise.  I've seen many aircraft flying at top speed including the F-4 Phantom during combat in Vietnam and this craft was much, much faster than any other.   I didn't report it because I had about 2 weeks left on my tour before going home and I thought I had just witnessed something I wasn't supposed to see.  I didn't want anything to delay my departure so I kept silent. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/14/1975 14:00  (Entered as : 07/14/75 14:00) Reported: 5/6/2006 9:08:20 PM 21:08 Posted: 5/15/2006 Location: Camp Hansen (Okinawa, Japan),  Shape: Triangle Duration:30 seconds", "date_time": "7/14/75 14:00", "report_link": "http://www.nuforc.org/webreports/050/S50446.html", "city": "Camp Hansen (Okinawa, Japan)", "state": null, "shape": "Triangle", "duration": "30 seconds", "summary": "Very large black triangular craft observed on Okinawa Japan traveling from very slow to out of sight in seconds.", "posted": "5/15/06"}
{"text": "Not dreaming becasue I went back to the same police officer Dear Peter,  This is the first time telling anyone about this event since the occurrence, except really really close friends.  What troubles me the most is the first time I saw the alien was at a very young age on my way home from school.  But the siting was while myself and two friends were on our way from elmira up the road through elm hghts to purchase beer.  I was 18 at the time and I am currently 48 years old.  Anyway, as heading down the road(Iwasin the back seat leaning between the buckets) and this light in the sky was coming right towards us as if it were following the road. We immediately pulled over and got out of the car, there it was hovering above (bout 15 feet above) the telephone pole.  It zigged zagged acrossed the sky east to west 3 or 4 times like it was showing off or something.  Then headed up the road the same direction we were going to travel.  As you probably can imagine we were yelling and screaming like three girls. ((deleted))  and the like.  As it traveled up the road it was like it wanted us to follow it cause the speed of this was never seen on this earth.  After about 1/4 mile we were at the Chemung County Fair grounds where we pulled over again and it hovered over us and just kinda like it was taunting us.  My two friends stayed next to the car (as I recall)  I went into the road and was screaming to cars passing \"stop stop look up look up\"  people just looked at me like nothing was happening.  This haunts me to this day cause I know they'll be back again soon it has been a while since the last time.  We went directly to the police dept in Horseheads to report this and the officer said \"go home and sleep it off boys\".  I wanted so bad to get some kind of evidence I called the local airport which is 10 minutes away and asked for the tower.  They said because of the low altitude they could not verify anything on radar.   It continued to fly over the tree tops then we lost site of it.  The second part that is most troubling to me is a few years later I ask the one guy I was with \" hey remember when?\"  He had no recollection of the event even happening, this really really disturbs me.  I know I wasnt dreaming and I know we got that ((deleted)) beer after that had happened. I was ready to get lit then.   I havent spoke to the third party in this event cause I was afraid too after what already occurred.  BTW_ NONE of the ((deleted)) pics match the craft \"WE\" saw.And the ((deleted)) aliens arent little gray men cause the ones that have visited me are 5 1/5 to 6 feet tall and are flatt black with no whites in thier eyes.  The one time they visited me I was able to take my right hand and pinch my left arm sooo hard there was a black and blue mark when I awoke.  I couldnt open my eyes or move anything else......no otherdrugs involved here.sooo those that don't believe will be the most surprised.. ((NUFORC Note:  Witness indicates that the date above is approximate.  We have assigned an artificial date in 1976.  PD))", "stats": "Occurred : 6/30/1976 21:15  (Entered as : 21:15) Reported: 4/7/2006 11:59:43 AM 11:59 Posted: 5/15/2006 Location: Elmira Heights, NY Shape: Circle Duration:10-20MIN", "date_time": "6/30/76 21:15", "report_link": "http://www.nuforc.org/webreports/050/S50010.html", "city": "Elmira Heights", "state": "NY", "shape": "Circle", "duration": "10-20MIN", "summary": "Not dreaming becasue I went back to the same police officer", "posted": "5/15/06"}
{"text": "Unknown object with flashing lights and laser beam behind the Hou ARTCC building/very fast moving I was an air traffic controller at the time.  Often we'd see objects on our radar and on a few occasions NORAD would scramble on them. (That's another topic).   The incident that I'm reporting occurred after the end of my shift. Three of us were hanging around in the parking lot talking.  One controller made a comment that Venus was bright that night.   We then started visibly scanning the sky.  We noticed a brighter light to the North of the ARTCC building and wondered if the other light in the sky was indeed  Venus, then what could that be. (The back door of the center faces east and leads to the back parking lot). The object was standing still and was just visible above the far tree line. Someone made a comment that it was probably a street light.   An airliner became visible climbing out of IAH but farther North of the light we were looking at.  The light then dimmed.  As the plane got farther away on its climb out, the light came back to the full density as we had seen before.  That got our attention.  We were wondering out loud what it could be.   At that moment,  the object moved from our left to our right at an extremely fast speed and stopped immediatley. almost a blur.  As fast as you can turn your head from 10 oclock to 2 oclock was the speed it seemed to move. (if east was 12 on the clock, then the object moved from 10 to 2).  We could not judge how far away from us it was.   The object then just stood still for a minute or two.  Very bright red, blue and green lights starting flashing around the object.  A thin laser like beam of light, approximatley 6 to 12 inches in diameter, lit up part of the parking lot and starting scanning the parking lot.   All three of us ducked behind a car without saying a word.  The beam shut off and the flashing lights stopped.  The   white light on the object then came back on and the object began moving very slowly back to our ten oclock position and stopped at the exact location it was when we first noticied it.  We didn't say a word for about a minute.   When it sunk in what we had just seen, all three of us jumped in our cars and left for home.   The next day, we considered reporting this to a national hotline number in Washington D.C., that the FAA had provided us to report strange occurences that we observe on our radar screens (UFO's)  but no one ever  did for fear of losing our airman's certificate. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 8/1/1976 23:20  (Entered as : 8/1976 23:20) Reported: 3/12/2006 1:57:55 PM 13:57 Posted: 5/15/2006 Location: Houston, TX Shape: Unknown Duration:10 to 13 mins", "date_time": "8/1/76 23:20", "report_link": "http://www.nuforc.org/webreports/049/S49569.html", "city": "Houston", "state": "TX", "shape": "Unknown", "duration": "10 to 13 mins", "summary": "Unknown object with flashing lights and laser beam behind the Hou ARTCC building/very fast moving", "posted": "5/15/06"}
{"text": "In September 1976, I had another UFO encounter.  This time I was out of the Army and living with my former girlfriend H. L. in an apartment.   One night, she came running back inside the apartment screaming.  I asked her what was wrong.  She said that a UFO was hovering 200 feet above her head.  I didn’t see anything.  I noticed she was hysterically crying.   I drove her to the Sacramento Sheriff’s Department and they had her use their phone to call an 800 number to call Dr. Allen Hynek of the Chicago, Illinois Bureau of UFO Investigations.  Dr. Hynek sent us some forms to fill out, so she could describe what she saw.  Dr. Hynek later called me and asked what I was doing.  I told him I was watching \"Dick Van Dyke’s The Comic\" on TV.  He asked what happened when Helen was screaming outside, I said the TV went on the blink, it displayed static and I was trying to fix the TV, when I heard her screaming.  He told me that when UFOs hover nearby, that they cause disturbances on car engines, TVs and radios.  This was a normal occurrence.  Later I learned that 2 other people in Sacramento saw the same UFO in two different locations and it was reported in the Sacramento Bee. From 1979 to 1986 I was back in the U.S. Army.  This time I joined Military Intelligence and I was stationed at PIC-K (Photo Interpretation Center, Korea).  This time my code name was \"Hollywood or Joe Hollywood,\"  I wore a black suit now and I was clean-cut.  I kept the sunglasses though.    My job as a 97 Bravo (Intelligence Analyst) was to work with Image Interpreters in identifying targets in North Korea and Red China, such as T-72 tanks, etc.  I would create what is called a \"sitmap\" pinpointing targets discovered by Image Interpreters, that studied reconnaissance aerial photographs.  I would categorize certain photos.  We would go on what is called a ‘hot run’ from Seoul, Korea, (Yongsan Barracks) to Osan Air Force Base.  The vehicle would display a placard that indicated that the vehicle could not be stopped for any reason.  There was a combination lock on the trunk of the vehicle and a combination lock in the suitcase inside the trunk,  the driver and myself would have ½ of the combination to open the trunk and the suitcase.  We would place the hotrolls (film) into the suitcase and head back to Seoul.   During my time as an Intelligence Analyst I categorized 6 photos taken by reconnaissance satellites of what appeared to be UFOs.  The UFOs moved on their own accord, as if they were guided by some kind of intelligence.  Therefore the 6 photos were significant by Military Intelligence.   The photos moved up the intelligence chain from Military Intelligence to DIA (Defense Intelligence Agency) to CIA (Central Intelligence Agency).  From there, I don’t know where the photos went.  While at PIC-K, I worked with Air Force Intelligence, Navy Intelligence, DIA, CIA, Marine Recon, US Army (Green Beret) Special Forces, 101st Airborne, US Army Rangers, 82nd Airborne, Delta Force, Navy Seals.  It was necessary for us to work closely with certain elite military groups.    Another strange photo I once saw was given to me to categorize.  It was a photo of an American POW in Vietnam, taken in 1981.  The photo went into a metallic box with a combination lock and disappeared up the intelligence channel.  The spooks (intelligence personnel) I worked with, would never discuss UFOs.  Most spooks belonged to some sort of secret society, most were Freemasons and I was a Rosicrucian.   When I departed Korea, I signed up for the 82nd  \"Screaming Eagles\" Airborne and Special Forces training and they were ready to send me to Ft. Gordon, Georgia and Ft. Bragg, North Carolina and I was called to do a special assignment.  I received an H identifier and became an Army instructor and taught the Soviet Threat for OPFOR (Opposing Forces).  I wore a Russian uniform, ski mask, black gloves and talked with a fake Russian accent and called myself \"Corporal Dowbowski.\"  I would instruct the Soviet Threat, teaching the W.E.F.T. (Wings, Engine, Fuselage and Tail) on Soviet Aircraft, kill zones on Soviet aircraft and land roaming vehicles, the use of many Soviet weapons from the AK-47 to the SVD Sniper Rifle in which I was proficient.   During my time with OPFOR, I learned from Intelligence circles, that the Russian KGB also knew and were aware of what exactly UFOs were and where they came from. To this day, I don’t know the answers to the UFO mystery, but hopefully one day our Government will disclose what they know to the public.", "stats": "Occurred : 9/15/1976 20:00  (Entered as : 09/15/1976 20:00) Reported: 4/28/2006 8:42:37 AM 08:42 Posted: 5/15/2006 Location: Sacramento, CA Shape: Oval Duration:6 minutes", "date_time": "9/15/76 20:00", "report_link": "http://www.nuforc.org/webreports/050/S50322.html", "city": "Sacramento", "state": "CA", "shape": "Oval", "duration": "6 minutes", "summary": "In September 1976, I had another UFO encounter.  This time I was out of the Army and living with my former girlfriend H. L. in an apart", "posted": "5/15/06"}
{"text": "The hi-pitches noise is what first alerted me to the disk. My family was watching t.v when the t.v started static and picture problems. The lights started blinking from dim to bright.My dogs were whining and scratching the back door wildly.Keep in mind my German sheperd had been qaurentine twice for biting people riding or walking ddown the alley.As well as a mean standard poodle. I went to let them in the house and when I opened the door they ran me over peeing and pooping as they crossed over me.The noise was very hi-pitched.I was 13 yrs old.My first reaction was to run where they did under my bed. I went as far as the bed room and ran back to lookfor my mom and brother. The front door was opened and I went to the porch and our neighbors and my mom and brother were all looking in the sky. I looked up and saw a huge disk shape houvering above the neighbor hood. It was so huge it could have destroyed at least two blocks if it landed. Now it gets even stranger.It is dark outside the sky is just a shade of dk blue but not quite black. The ship is almost the same color or a shade just lighter from the color of the sky. I'm histerical and run in the room where my dogs are. I grab the phone to call police,my dad anyone because I'm scared but remember I have to go getmy mom and little brother. The sound of the ship is head jolting. I ran to get my mom and brother in the house but they just stair in the sky. I grab my neighbor hand and tell her to run. But could'nt budge her. I ran back to the porch behind the bushes surrounding the porch and look up in ahh. I notice that it is round in shape like a washer that goes on a screw then criss-crossing are bars that connect to the center of the disk which is like a black smoke-glass sphere. It didn't have windows and I would have to guess maybe that the center was like a smoke glass marble and they were watching us. Anyway, the outer part begin to have lights red,green,yellow,blue four in a row from my angle i could see blinking at the front side and back of the ship. They blinked in a harmony like way. Then as it went higher u in the sky it's shape seemed to change and the criss-cross bars went in and the disk was smaaler in size and it went up and shot ahead in the sky so fast it was gone. I ran out into the yard where everyone seem to be calm and alert. I was screaming did you see it lets call someone. And mom said calm down it's time for bed. Pat the neighbor was telling every one good night. I was alarmed that everyone was so calm and non-shalaunt about the situation.The next day my mom the neighbors all of them said they didn't remember seeing anything last night. But they couldn't explain why my legs were all scratched up from the dogs running me over in the kitchen and the back door being almost scratched in too from the dogs. I've told this story to every one I know and they just look at me like I crazy. And as god is my witness, I've been when three of them and together they witnessed again another ufo sighting. Do they keep an eye on you once you spot one of them. I've never seen a allien, but I  have seen at least three other ships since I have seen that one at 13. One had three lights and was triangle shape, one just a blue sphere never loosing altitude and traveled in a perfectly straight direction. and yet another like jacks shaped. You know the jacks and ball little girls played as a child. With light on all five ends. They were at close distances and was also a bit over whelming even as I am now a adult. I had the same fear rush threw me as I did as the 13 year old girl who seen the mother of all ships. Nothing has ever come close to the sighting I seen at the house in Dallas,Tx. Whats even stranger is..... Since 1998 I have had a series of dreams.That seem to be messages from alliens. They were very clear and in color that was so bright. Over a two year period I had five that were so real. I have to question if they are related. One thing I am clear on is this. Somethings out there.", "stats": "Occurred : 10/30/1976 16:30  (Entered as : 10-30-1976 16:30) Reported: 3/17/2006 9:27:46 AM 09:27 Posted: 5/15/2006 Location: Dallas, TX Shape: Disk Duration:16:40", "date_time": "10/30/76 16:30", "report_link": "http://www.nuforc.org/webreports/049/S49693.html", "city": "Dallas", "state": "TX", "shape": "Disk", "duration": "16:40", "summary": "Somethings out there", "posted": "5/15/06"}
{"text": "I was a kid and here i what i remember.  I was all ready looking strait up at it. It was a disk shaped craft, golden color, round windows. i was out side my house playing like always,in the front yard. I did not see or hear it coming or come. It was strait over my house, above me, i could throw a rock at it, like i said all i know is i was already looking at it strait over me.I was not afraid, i did not run.After locking for a minet it took off at the speed of lite, and made no noise.I told no one. after that my noise would start bleeding, my head would spin and i got the out of body feelings,along with a sort of huming in my head, this would happen thruw the rest off my childhood.I did not watch tv nor know what a ufo was, i kept my self intertaned. i am 40 now and can tell you some storys. there is some technology that can hook on to your neurons, and bodie, and talk to you, talk to your neurons, your brain. this technology can control your bodie functions,totaly. brother im telling you that you dont even have to be around this technology, it is global. ive traveled on a plain and the same results,controling all around. i can pick up the phone and call any one in the phone diretery and by the time they pick up every one around is on it. i mean every has some thing telling them about this guy that they never met or know, this tech will point him out when he comes around, rigth in your head, your brain, neurons.the tech can torture you or your freinds, r all of them all at the same time ,global.i know more than the avarege guy. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/1/1977 16:00  (Entered as : 06-1977 16:00) Reported: 3/19/2006 7:23:35 AM 07:23 Posted: 5/15/2006 Location: Fort Worth, TX Shape: Disk Duration:1minet", "date_time": "6/1/77 16:00", "report_link": "http://www.nuforc.org/webreports/049/S49724.html", "city": "Fort Worth", "state": "TX", "shape": "Disk", "duration": "1minet", "summary": "I was a kid and here i what i remember. I was all ready looking strait up at it. It was a disk shaped craft, golden color, round window", "posted": "5/15/06"}
{"text": "Close encounter with metallic craft near Gaithersburg, MD in 1977 The following was described to me a 45 year old man whom I believe to be very sincere and credible.  I do not have contact information for the witness presently, but I can get it. In 1977 the witness (age 17 at the time)and his cousin were returning home to obey their 12 a.m. curfew.  As they were heading up a road towards the Heights in Montgomery Village, MD, near Gaithersburg, the witness saw a light through some trees at the top of the hill and asked his cousin \"What's that?\". His cousin replied \"They're digging a lake up there; it must be some construction lights.\"  They continued up the hill, came around a bend in the road, and saw a cigar-shaped object hovering over a telephone pole approximately 40 feet in the air and 50 feet in front of them.  The witness and his cousin stopped the car and got out to look at the object, which he described as shaped like a \"one-manned submarine\", being about the size of a school bus, and as having a metallic skin, 2 beams projecting from the \"front,\" and a row of \"portholes\" and non-blinking red and green lights around the circumference.  The object was completely silent and stationary for approximately 20 seconds, then made a soft, mechanical \"verrrt\" sound and began to move slowly away.  The witness emphasized 2 things: how \"man-made\" and \"nuts and bolts\" the object seemed (\"like an airliner with no tail, wings, or jet engines\") and the strange way that it appeared to move away slowly, yet diminished rapidly in size until it disappeared.  He had a difficult time describing exactly how the object departed.  He said that the surface of the craft was visible from the glare of the projecting beams (\"kind'a like laser beams, not spreading out like headlights\"), and that it was metallic.  There were also dark patches above the view ports where he thought there was some movement visible (as in something moving inside the object).  The witnesses' car exhibited no electromagnetic effects from the close proximity of the craft; the engine continued to idle and the headlights remained on, and neither witness suffered any physiological effects.  He said that he and his cousin were open-mouthed in amazement, but never felt frightened during the encounter.  What also astonished the witness was that this sighting took place shortly before midnight in the middle of a suburban bedroom community with many houses in the area, but no one came out of their home to investigate the bright lights above their neighborhood.  He looked in the newspapers, but failed to find any reports of UFO sightings in the next several days. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/1/1977 23:45  (Entered as : 1977 23:45) Reported: 4/28/2006 8:34:48 AM 08:34 Posted: 5/15/2006 Location: Gaithersburg, MD Shape: Cigar Duration:60 seconds", "date_time": "6/1/77 23:45", "report_link": "http://www.nuforc.org/webreports/050/S50320.html", "city": "Gaithersburg", "state": "MD", "shape": "Cigar", "duration": "60 seconds", "summary": "Close encounter with metallic craft near Gaithersburg, MD in 1977", "posted": "5/15/06"}
{"text": "Huge Triangle over Whittier in 1977 I have been looking at many UFO sites for years and have even had a photo posted a few years ago of a UFO I got a picture of while in Washington State.  I even submitted photos last year that showed objects in front of me and around me while driving from Texas to California.  Needless to say I have had a few sightings.  What brought me to write today was that I noticed a few reports from the 1977-78 period of pretty much what I saw myself in the city of Whittier.  I am in my late 30's now and at the time I was in 6th grade.. The time was close to 4pm because my friend's mom was the manager of a donut shop and we would go pig out there everyday after school.  We got to the corner of Lambert & Colima when one of the kids yelled \"hey look a rocket\"!. We looked up towards the Hacienda Hts area.  There is a big hill you have to go over that leads into Hacienda Heights using Colima Rd.  We saw the object in plain sight but at first all we could see was a flame coming out of something.  It was right above Colima Rd at the top of the hill.  That is a major pathway for planes coming into LAX.  They come in every few minutes so someone had to have seen something.  We continued watching the object and then it started to move high into the sky but towards our direction and settling directly above.  As it got above our heads (several thousand feet in the air), I could see it perfectly, it was a huge  Triangle with different colored blinking lights on the side (specifically blue & red), a flame coming out of the back, and a bright white light at the tip.  It stayed up there for at least 2 hours.  Didn't move.  The time was now way after 5pm and it started to get dark. The triangle was now blending in perfectly with the stars.  I remember still faintly being able to see the red/orange flame coming out the back and not really being able to see the red & blue lights on the sides anymore.  My neck was hurting so badly from looking straight up for all that time that I finally had to take a few minuets rest.  When I looked back up I couldn't find it but all the kids were saying \"it's right there\" and pointing it out to me.. Well I just couldn't find it anymore because it just blended in with the stars so well. I ran home to tell my family but who would believe a young kid saying such a story.  I mean, if it were that big, flying in LAX air traffic space, in plain sight, then why was there no news covereage or any mention of it??  Well I never did hear anything about it but I know what I saw. It is fresh in my memory to this day as if it just happened yesterday.  Who knows maybe since we were kids, the er uh \"visitors\" only allowed us to see them.  But whatever it was, it was huge, it was close, and it was real.   I would also like to add that a few years later (early 80's) I was watching a UFO documentary and they told the story of a man in either Wyoming or Montana that shot at a UFO that was chasing him.  Well guess what?  He drew the exact same thing I saw that day.  The triangle, flame coming out the back, bright white light at the tip, and different colored lights on the side.   I got excited and called my brother to come watch and asked him if he remembered the UFO story I told him about a few years back, I said \"that's exactly what I saw\".  He just basically said \"are you sure\" and I said \"I'm positive\" (to which he replied \"what a trip\").   I guess I got so excited because someone other than the group of kids and myself actually had an encounter with this thing and drew it in all exactness of what I saw that day.. I read about the enormous Chevron craft seen by a woman over the 605 fwy that same time period as well as another story relating to the same info and I knew I had to include my experience as well.  The area over Colima Rd is a sort of UFO hotspot.  In 1998 after leaving a friend's house just before midnight, I drove up Colima Rd coming from Hacienda to Whiiter, and as I neared the top of the hill a White light just shot across in front of me. I sped up to try and get another look but it was long gone.  It was just like a Blip but I saw it and it was not a reflection from any other lights because for those who know that hilltop, there is a small area where there are no street lights, that's where it flew across.   I feel relieved in a sense to hear that other people have come across what I saw that day back in the late 70's.  Although I know what I saw, it's just so relieving to know that I wasn't alone and that others came across some big, weird stuff they can't explain either.  I gotta tell you, seeing something like that is better than getting your first bicycle on Christmas - it really is. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/30/1977 16:00  (Entered as : 1977/78? 16:00) Reported: 4/7/2006 1:24:56 PM 13:24 Posted: 5/15/2006 Location: Whittier, CA Shape: Triangle Duration:2 hrs.", "date_time": "6/30/77 16:00", "report_link": "http://www.nuforc.org/webreports/050/S50013.html", "city": "Whittier", "state": "CA", "shape": "Triangle", "duration": "2 hrs.", "summary": "Huge Triangle over Whittier in 1977", "posted": "5/15/06"}
{"text": "Cigar shaped ufo moving at speed of falling star but stoped. Im allmost 40 years old and this sighting occured when I was approx 11 years of age, although I remember it like it was yesterday.  I come from a family of five and my father is a well known surgeon in the area.  I am currently finishing a BS degree at a well known university studying Geog and Gis etc.   Unfortunatly I recently fell victom to Leukemia and had to take some time off school.  I ve been watching alot of History channel etc on ufos and when I can I sometimes listen to coast to coast, (unless I just can't bear to listen to some of the bs from some people).  Well one night, I was lying outside on my deck on a recliner looking up at the clear dark sky.  When all of a sudden a cigar shaped craft with green glowing like airplain windows flew over my house moving at the speed of a falling star except it stoped and I think looked at me and then resumed from 0  to the speed of a falling star and went twards the SFO airport and curved as it left.  Never the less this was no falling star.   I've done some reasearch on the ufo subject and what bothers me most about it are all the people who have everything to loose and nothing to gain by coming forward with knoweldge of this subject.   I hope this is helpfull to someone.  Also I do beleive if you concentrate on seeing a ufo enough it could appear (maby they are able to focus on thought) however I dont suggest it.  I will never forget what I saw (almost like a cartoon?) but I know that man dos not have this technology even today. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))", "stats": "Occurred : 7/12/1977 01:30  (Entered as : 07/12/77 1:30) Reported: 4/10/2006 12:31:41 PM 12:31 Posted: 5/15/2006 Location: Hillsborough, CA Shape: Cigar Duration:4to5 sec", "date_time": "7/12/77 01:30", "report_link": "http://www.nuforc.org/webreports/050/S50088.html", "city": "Hillsborough", "state": "CA", "shape": "Cigar", "duration": "4to5 sec", "summary": "Cigar shaped ufo moving at speed of falling star but stoped.", "posted": "5/15/06"}
{"text": "IT WAS IN THE SUMMER OF JULY-1977 WE HAD A WINDOW FAN SITTING IN OUT BED ROOM WINDOW,SOMETIMES IT WOULD GET OFF BALANCE,AND I WOULD GET UP AND JAR IT ONE WAY OR THE OTHER TO MAKE IT STOP VIBRATEING, THIS ONE NIGHT I GOT UP TO JAR IT I LOOKED UP AND SAW A FLYING SAUCER IN MY FATHERINLAWS BACK YARD JUST ABOVE THE TREE TOP'S SITTING DEAD STILL IN MID AIR,AND NOT MOVING.I WATCHED IT FOR A LONG TIME,I TRIED TO GET MY WIFE TO GET UP AND SEE IT BUT SHE TOLD ME I WAS CRAZY AND TO GET IN BED,WELL I KEPT WATCHING IT,AND THEN A WHILE LATER MY FATHER INLAW DROVE UP AND HE GOT OUT OF HIS CAR AND LOOKED UP AND SAW THIS THING,WELL HE DIDN'T KNOW THAT I SAW IT UNTIL THE NEXT DAY WHEN I CAME HOME I WENT UP TO HIS HOUSE AND TOLD HIM THAT I ALSO SAW IT,HE WAS SHOCKED TO KNOW THAT I ALSO SAW IT,HE WAS GLAD THAT I CAME AND TOLD HIM ABOUT IT. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 7/15/1977   (Entered as : JULY]1977) Reported: 3/23/2006 9:13:38 PM 21:13 Posted: 5/15/2006 Location: Rock Hill, SC Shape: Disk Duration:", "date_time": "7/15/77", "report_link": "http://www.nuforc.org/webreports/049/S49789.html", "city": "Rock Hill", "state": "SC", "shape": "Disk", "duration": null, "summary": "IT WAS IN THE SUMMER OF JULY-1977 WE HAD A WINDOW FAN SITTING IN OUT BED ROOM WINDOW,SOMETIMES IT WOULD GET OFF BALANCE,AND I WOULD GET", "posted": "5/15/06"}
{"text": "Pensacola, FL- a space craft of immese size appeared without sound In the spring-summer of 1978, my best friend and I were driving on Interstate 10 in Pensacola. We were heading East to Santa Rosa County. The sun had gone down as we traveled on Interstate 10. As I was driving, I was close to the water tower that is on the interstate which is just before the bridge going over Escambia Bay.  All of a sudden and out of nowhere, a space ship was suspended over the interstate before the bridge. There was no sound eminating from the spacecraft however, it was extremely large; almost covering the width of the interstate.  Also, it was vast in height in comparison to a five or six-story building.  Underneath the craft, the structure seemed to be comprised of steel girders with a circular area in the middle of the bottom of the spacecraft. It was lit up so that one could see the structural design of the craft. The main superstructure was very large with colored panels lighting up at times. I recall a red, blue or green, and yellow panel lit up as if the space craft was tying to communicate something using color and the sequence of when the panels lit up. There was no sound coming from this sighting. It was just suspended in space. It was so close to my friend and me. Then all of a sudden the lights went out and in total darkness and without sound, the craft moved over the water tower. It was hovering over the tower when out of the circular area located at the bottom of the craft, a light shown down on the water tower. It was as if the light was searching the tower and nearby land where the tower was built. Again, the lights went out and without and trace of sound, the spacecraft moved a little west and farther into the sky. Again, it was suspended in the sky and the only lights eminating from it were white lights. If I am not mistaken, the lights seemed to be outlining the perimeter of the spacecraft. It has been several years since my friend and I saw this sighting. If I am not mistaken, once the craft had allowed us to see the white lights surrounding the perimeter, it fled in an amazing speed towards the southeast. That was an incredible evening for both my friend and me. Once arriving to my home, excitedly, he and I ran into the house sharing this information with my parents. I called the local newspaper and radio station(s) explaining what we had seen and asked if anyone had seen the same thing to please get in touch with me. However, as was in a lot of cases back in the 70's, the receiver(s) of my inquiries laughed in unbelief. Today, I know this sighting was real. I don't have to prove anything to anyone to the reality of this matter because I, as well as my friend, know what we saw was truth. I only wish I could have communicated with the intellectuality of the spacecraft to understand more. But yet, maybe another time will take place so that intelligence can share and learn from other sources within the universe. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/1/1978 19:00  (Entered as : 1978 19:00) Reported: 3/15/2006 2:34:26 PM 14:34 Posted: 5/15/2006 Location: Pensacola, FL Shape: Oval Duration:10-15 minutes", "date_time": "6/1/78 19:00", "report_link": "http://www.nuforc.org/webreports/049/S49655.html", "city": "Pensacola", "state": "FL", "shape": "Oval", "duration": "10-15 minutes", "summary": "Pensacola, FL- a space craft of immese size appeared without sound", "posted": "5/15/06"}
{"text": "Ocean City, NJ, triangle of 3 lights, hovered over condominium, no sound, departed with incredible speed It was late summer or early fall of 1978.  I was riding bikes around 8:00pm on the Ocean City, NJ boardwalk with a friend.  There were about 20 other people walking on the boardwalk.  At about 4th street, we all stopped to look at some extremely bright lights out in the ocean near Atlantic City.  In a matter of seconds, the lights were directly above the condominium complex at 4th Street and the boardwalk in Ocean City.  They were three lights in a triangle shape.  There was absolutely no sound.  We all just stood there in shock, looking up at the lights, trying to discern a craft or something.  The lights hovered there for about 10 minutes  Suddenly, the lights took off at an incredible speed in a southwest direction.  No one said anything - there was nothing to say because it was unexplainable.  I wish someone could explain this experience to me. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))", "stats": "Occurred : 6/1/1978 20:00  (Entered as : 1978 20:00) Reported: 4/21/2006 4:15:28 PM 16:15 Posted: 5/15/2006 Location: Ocean City, NJ Shape: Triangle Duration:10 minutes", "date_time": "6/1/78 20:00", "report_link": "http://www.nuforc.org/webreports/050/S50220.html", "city": "Ocean City", "state": "NJ", "shape": "Triangle", "duration": "10 minutes", "summary": "Ocean City, NJ, triangle of 3 lights, hovered over condominium, no sound, departed with incredible speed", "posted": "5/15/06"}
{"text": "3 ft. dia  tan colored spherical object manuveing at 120+ knts. I was piloting a Piper Cherokee 140 airplane returning to the Gadsden Airport after some recreational flying approaching from the north about 5 miles out, when I passed the object at about 1000 Ft. above ground level.  It was about 20 ft. off of my left wing.  It was about 3 feet in diameter, tan in color, and looked like a weather balloon except that it had no inflation nozzle, no radiosonde attached to it, and it was perfectly round.  Weather balloons have a teardrop shape to them when strapped to a weather gathering payload.  I circled back to get a closer look and noticed what appeared to be a red crecent moon or a hammer and scycle shape on it reminiscent of the emblem on the former Soviet flag.  As I circled around a second time to get closer look, the object moved away from me and maintained a distance of about 50 to 75 yard spacing between itself and my plane. When I became aware that the object could manuver, I was certainly rattled.   I tried to pursue the object about a minute or two but it accellerated away to the point that I could not keep up with it.  I was traveling at 120 knotts.   Scared, I opted to return to the Gadsden Airport.  When I arrived home, I reported the sighting to the Anniston Flight Service Station.  I believe the attendant at the FSS was unofficially impressed, but I don't know weather or not he officially filed my report.  I believe the UFO to be either alien, a Top Secret USA probe, or the Russians aren't telling us something.  I maintain that what I saw was not a weather balloon and flew under its own power.  I strongly believe the markings were used camoflage the UFO to be from Earth. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 8/15/1978 15:30  (Entered as : 8/15/1978 15:30) Reported: 4/29/2006 5:28:28 PM 17:28 Posted: 5/15/2006 Location: Gadsden, AL Shape: Sphere Duration:10 Min.", "date_time": "8/15/78 15:30", "report_link": "http://www.nuforc.org/webreports/050/S50346.html", "city": "Gadsden", "state": "AL", "shape": "Sphere", "duration": "10 Min.", "summary": "3 ft. dia  tan colored spherical object manuveing at 120+ knts.", "posted": "5/15/06"}
{"text": "Three lights in the shape of a triangle. I was looking at this web sight for the first time and saw an event entered 5/1/2005 that must be the same event that I experienced.  The writer dated the event 5/12/1980 but said he wasn't sure.  I think the event was approximately September of 1978 or 1979.  I was 16 or 17 and driving home from work on interstate 70.  I was headed east from Indianapolis to Greenfield.   I would say somewhere between the Mt. Comfort Rd. exit and the Greenfield exit, I saw 3 lights in a triangular shape.  The lights were primarily white but I do remember some occasional red and blue.  It would have been around 9:15 based on where I was on my trip home.  The lights moved in relation to each other and formed different sizes of the same triangle. I exited interstate 70 at Greenfield and turned north on highway 9.  I then went approximately 1 mile until I reached 300 north and turned west. (I was still headed home)  Very shortly after I turned onto 300 north, I could see something above me.  I have always described it as a \"density\".  It was too close above me to make out a shape.  When I looked up, it was big enough that I couldn't see sky on any side of the object.  I have also always said it was probably bigger that two 2 story houses.  I have also said it would be like standing under a large passenger jet, that is on the ground, and looking up.  You could just see the underneath.  I couldn't see the lights at that time and I could not make out the color of the object, just that there was something above me. There was no sound. I am guessing this lasted for just a few seconds until I drove past it.  I went home and made it by my normal time which was approximately 9:30.  I told my parents and they could tell I was visibly excited.  The next morning, I was sitting in my high school home room and they came over the intercom and said the National Enquirer was in the office and wanted to interview anyone having seen a UFO.  I did not go because I was too embarrassed to get up in front of the home room.  I do not know if anybody went.  That evening, the Greenfield Daily Reporter ran a front page article.  In that article, it reported finding markings in a field.  These markings were found somewhere on the opposite side of highway 9 than I had turned.  I turned to the west of 9 and these were found on the east of 9 and at about the same area as 300 north.  I feel it must have been headed east when I saw it.  I match my dates due to where I was working.  I really felt it was in the fall because of feeling new in the home room class.  I did go back to the Hancock County Library a couple of years ago and tried to find the paper.  I was unable to find any article, but I did concentrate on the fall only.  I will make an attempt to go back soon and start checking all of 1978 and 1979.  I will also check to make sure that all of the papers are there. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 9/1/1978 21:15  (Entered as : 09/01/78 21:15) Reported: 3/21/2006 4:18:28 AM 04:18 Posted: 5/15/2006 Location: Greenfield, IN Shape: Light Duration:15 - 20 minutes", "date_time": "9/1/78 21:15", "report_link": "http://www.nuforc.org/webreports/049/S49753.html", "city": "Greenfield", "state": "IN", "shape": "Light", "duration": "15 - 20 minutes", "summary": "Three lights in the shape of a triangle.", "posted": "5/15/06"}
{"text": "v formation of lights in outer space turning 90 degrees I was stationed at Cold Lake Alberta air force base and was partying with numerous people at a large lake late at night. The sky was crystal clear and there were billions of stars.  I was star gazing and noticed a v formation of 5 lights in outer space. They were moving very fast across the heavens and they suddenly stopped on a dime, turned 90 degrees (while still in formation), and accelerated at high speed until they were out of our sight.   I pointed it out to approx. 18 people that were with me and they were all amazed. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 5/20/1979 01:00  (Entered as : 05/20/1979 01:00) Reported: 4/16/2006 7:41:50 PM 19:41 Posted: 5/15/2006 Location: Cold Lake (Canada), AB Shape: Formation Duration:45 seconds", "date_time": "5/20/79 01:00", "report_link": "http://www.nuforc.org/webreports/050/S50143.html", "city": "Cold Lake (Canada)", "state": "AB", "shape": "Formation", "duration": "45 seconds", "summary": "v formation of lights in outer space turning 90 degrees", "posted": "5/15/06"}
{"text": "Mother and two children recall ufo experience It was a summer night around 9 pm and my mother and my sister and I were swimming in our above ground pool in our back yard.  We had heard a light buzzing sound and turned around to see a craft with orangeish colored lights, hovering less than 20 yards from us.  That is all any of the three of us remember and in fact we didn't talk about it for almost ten years, like it had been teporarily erased from our memories, until one night when someone brought up UFO's and the three of us spoke up about our experience.  How could someone put something like that into the back of their brains.  After talking about it for awhile, none of us recalled the craft leaving and we believe that we may have lost some time. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 8/20/1979 21:00  (Entered as : 08/20/79 21:00) Reported: 3/11/2006 3:36:17 PM 15:36 Posted: 5/15/2006 Location: Phoenix, AZ Shape: Disk Duration:5 minutes", "date_time": "8/20/79 21:00", "report_link": "http://www.nuforc.org/webreports/049/S49532.html", "city": "Phoenix", "state": "AZ", "shape": "Disk", "duration": "5 minutes", "summary": "Mother and two children recall ufo experience", "posted": "5/15/06"}
{"text": "A very low flying UFO over the Hudson River in the early Fall at twilight! Everyone standing in the street seemed frozen in time, so I can't really say how long the sighting was, and we were left speechless for at least 10 minutes after witnessing a saucer flying very low and lights of differing colors spinning on the bottom of the craft,  I recently told this to a friend who lived in Queens NY, who also remembers seeing a UFO over the Hudson river at sunset around the same year and season...it could have been the same event.  I never read any news in the paper or saw a TV report...I wonder why I didn't talk of it for years? ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD)) ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))", "stats": "Occurred : 9/15/1979 17:00  (Entered as : 09/??/79 17:00) Reported: 3/16/2006 7:29:02 AM 07:29 Posted: 5/15/2006 Location: East New York, NJ Shape: Disk Duration:1-3 min.", "date_time": "9/15/79 17:00", "report_link": "http://www.nuforc.org/webreports/049/S49668.html", "city": "East New York", "state": "NJ", "shape": "Disk", "duration": "1-3 min.", "summary": "A very low flying UFO over the Hudson River in the early Fall at twilight!", "posted": "5/15/06"}
{"text": "At approximately 1AM in September of 1979, a police officer two towns south from the town I work in called our mutual neighboring police department to report a strange object in the sky.  The object was a pulsating light and the shape was unknown.  It appeared to be five miles out over the ocean and was moving slowly north by northeast.  After watching it for a few minutes, the police officer directly south of my town contacted us and told us that there was an object over the ocean, approximately five miles out over the ocean heading our way.  Two police officers were sent to the beach area where they were able to see the object.  The Sergeant guessed that it was 500 feet off the ocean between 3 to 5 miles out over the ocean.  When it was directly off our coastline, the object made a sudden turn South and disappeared.  A week prior to this sighting, a caretaker of a local lighthouse called our police station, quite upset.  He asked to have an officer come see him regarding an object  that was actually floating on the water approximatley 100 yards off the rocks. He saw the object from ground level and ran up to the top of the lighthouse to get a btter look.  When he got to the top of the light house, the object took off from the water straight up in the air.  The object lifted at a high rate of speed, not consistent with a helicopter or anything he was familiar with.  He wanted to see one of our officers to confirm that he had not been drinking and was sane (he had to make a report to his supervisors).", "stats": "Occurred : 9/21/1979 01:00  (Entered as : 09/21/1979 1:00) Reported: 3/16/2006 10:03:09 AM 10:03 Posted: 5/15/2006 Location: Cape Elizabeth (near; location unspecified by witness), ME Shape: Light Duration:Two Hours", "date_time": "9/21/79 01:00", "report_link": "http://www.nuforc.org/webreports/049/S49670.html", "city": "Cape Elizabeth (near; location unspecified by witness)", "state": "ME", "shape": "Light", "duration": "Two Hours", "summary": "At approximately 1AM in September of 1979, a police officer two towns south from the town I work in called our mutual neighboring polic", "posted": "5/15/06"}
{"text": "This was scary as I never saw my father again When I was hunting with my father in the forest, I saw a cross shaped object floating in the sky.  It was emitting what looked like a purple colored beam towards a herd of deer that we were stalking.  Afterwards, I felt sort of in a trance then 2 beings walked out and zapped my dad with something, then abducted him, this is all I remember from that day. ((NUFORC Note:  We assume that this report was submitted as a serious-minded account of the event, but we cannot be certain that that is the case.  PD))", "stats": "Occurred : 11/3/1979 23:50  (Entered as : 11/3/79 23:50) Reported: 5/5/2006 8:19:39 AM 08:19 Posted: 5/15/2006 Location: Brampton (Canada), ON Shape: Cross Duration:30 sec", "date_time": "11/3/79 23:50", "report_link": "http://www.nuforc.org/webreports/050/S50427.html", "city": "Brampton (Canada)", "state": "ON", "shape": "Cross", "duration": "30 sec", "summary": "This was scary as I never saw my father again", "posted": "5/15/06"}
{"text": "Missing Time: Two People My mother and I have a long history of UFO sightings/involvement.  It's highly possible that there was an abduction experience when I was not quite three, and my mother was 23, involving not only us but a busload of soldiers en route to Augusta, GA, in 1957.  But when the incident I'm reporting now happened, I was around 25, and my mother was 45.  I had driven from my suburban Alexandria home to visit my mother in Front Royal, VA, and we decided it was a lovely summer afternoon for a drive.  We went on one of our old favorite rides: to a nearby mountain where an airliner had crashed a number of years before, just up the road from a semisecret military installation.  The road led through some beautiful countryside, and we'd always enjoyed taking leisurely drives and talking about life in general.  My mother and I had seen many UFOs, both together and separately, and had, as mentioned earlier, a bizarre bus trip when I was very young, but on this summer day the conversation was light, and the subject matter was strictly terrestrial... except, of course, for our traditional speculation on what went on at that semisecret military complex out in the boondocks yet so close to DC.  We were travelling north in bright sunlight early in the afternoon... then the next thing we remember, we were travelling south, about 20 miles from where we last remembered being, and the sun was almost setting.  We both seemed to be coming out of a brain fog -- speech was very difficult.  My mother spoke first, saying in effect \"How did we get here, and how can it be this late?\" It took great effort for me to respond that I had no idea.  We literally did not say another word for the remaining forty minutes of the trip -- very unusual for two chatty sorts, especially given the circumstances.  I could not comprehend how I could have been driving in such an apparent fugue state, and that both of us were in the same condition was quite disturbing.  Neither of us could remember a single thing that had happened to us during the five or so hours just past... and neither of us were capable of talking about it -- or talking about anything else, at that time.  Even years later, it was exceedingly difficult for us to discuss the incident beyond the bare known facts, and both of us vividly recalled the incredible introversion of our thoughts on the way back to her house.  But we both, as we managed to admit to each other years later, were positive that we had seen \"something,\" that a craft (UFO) was involved.  Our difficulty talking about this event even years later seemed perhaps the result of a mental block of some sort placed by an outside source.  Especially given our individual and shared histories with UFO sightings (also witnessed by others numerous times), there was little doubt in either of us that we'd had an intense and lengthy encounter with something, and some entities, decidedly not of this world.  The roads we were travelling  My mother was an accountant for a furniture/appliance store, and I was a chef/restaurant owner (physically a bit disabled now, thanks to years of heavy lifting, etc.) and am now a professional artist and writer.  This report is probably only the first in a somewhat long line -- it's time I deal openly with the strangeness in my life that seems to have revolved around UFOs, and this is step one.  I'm very open to discussing the full range of experiences and incidents with an investigator, if you or an associate are interested.  I will also consider hypnosis in order to penetrate the mental veil concealing the two incidents of missing time, providing that the hypnotherapist is reputable and well-versed in probable abduction incidents.  Those two incidents have haunted me for so long -- once for nearly fifty years -- and I'd like to know the truth, however discomfiting it may be. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))", "stats": "Occurred : 6/24/1980 14:00  (Entered as : 06/24/80 14:00) Reported: 4/6/2006 8:45:08 PM 20:45 Posted: 5/15/2006 Location: Mount Weather (near Leesburg), VA Shape: Unknown Duration:possibly 5 hours", "date_time": "6/24/80 14:00", "report_link": "http://www.nuforc.org/webreports/049/S49998.html", "city": "Mount Weather (near Leesburg)", "state": "VA", "shape": "Unknown", "duration": "possibly 5 hours", "summary": "Missing Time: Two People", "posted": "5/15/06"}